doc/journal.org
#+TITLE:Main Dissertation Notes

#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t

#+author: Jason Cairns
#+email: jcai849@aucklanduni.ac.nz
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.1 (Org mode 9.2.3)

#+latex_class: article
#+LATEX_CLASS_OPTIONS: [a4paper, 11pt]
#+LATEX_HEADER: \usepackage{natbib}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \usepackage{amsfonts}
#+latex_header_extra:
#+description:
#+keywords:
#+subtitle:
#+date: \today

* Dissertation Due                                                 :noexport:
  DEADLINE: <2019-10-29 Tue>
* COLOPHON                                                         :noexport:
Work was all done in emacs, with the code in R, tangled through org mode
* Initial Survey
** Prescribed Reading
- [[https://www.tidytextmining.com][Text Mining with R]]: [[./text_mining_with_r.org][notes]]
- [[https://m-clark.github.io/text-analysis-with-R/][Text Analysis with R]]
** Initial Consideration of Application Features
*UX/UI* must be intuitive, modelling the inherently non-linear workflow,
while fitting in with the iNZight / lite environment. I wrote some notes
on UX/UI [[./ux_ui.org][here]].

*Text Classification* seems to be a hot topic in sentiment analysis, but
the question remains of whether it is within our scope (I suspect not).
If it were, [[https://cran.r-project.org/web/packages/openNLP/][openNLP]], along with some pre-made [[https://datacube.wu.ac.at/src/contrib/][models]], would likely serve 
this topic well. An interesting example of text classification in the
Dewey Decimal System is given [[http://creatingdata.us/models/SRP-classifiers][here]].

*[[../reading/Thurner2015%20-%20Understanding%20Zipfs%20Law%20of%20Word%20Frequencies%20through%20Sample%20Space%20Collapse%20in%20Sentence%20Formation.pdf][Zipf's Law]]* is referred to regularly in text analysis. Should we
demonstrate this directly, as part of some other analysis, or not at
all?

The *form of analysis* will vary enormously with different forms of
text. There are some things constant for all forms of text, but a good
deal is very specific. For example, the information of interest will
differ between novels, discourse (interviews, plays, scripts), twitter
posts, survey response data, or others. It may be worthwhile to either
focus solely on one, or give the option to specify the type of text.

*Data structures* will change based on the text type, and the packages
used. With a tidy dataframe as our base structure, it is easy enough to
convert to specific objects required by various packages, harder to
convert back.

There is a natural link between *text analysis and Linguistics*, and a
significant amount of the terminology in the field reflects that. Our
application requires far more market share than one that a mention in a
third year linguistics paper provides, and so linguistics is not going
to be our primary focus. Regardless, many forms of analysis require some
linguistic theory, such as those dependent on Part of Speech tagging, so
it is still worthwhile to keep in mind
** Twitter
Twitter data looks particularly interesting, as it is a constantly
updating, rich source of information. I wrote up some notes on text
mining twitter [[./text_mining_twitter.org][here]]. It would be particularly interesting to view
twitter data in the context of discourse analysis.
** Subtitles
Subtitles are a unique form of text that would be very interesting to
analyse. Subtitles for films and TV Series can be obtained easily from
the site [[https://www.opensubtitles.org/en/search/subs][opensubtitles]], though
obtaining subtitles programatically may be more difficult. It clearly is
possible, as VLC has an inbuilt feature, as does [[https://github.com/zerratar/SubSync][subsync]], which is written in
C#, so would require a port to R (probably not worth it for us at this
point). Subtitles usually come as .srt files, and once the file is
obtained, it's easy enough to import and work with it in R with the
package [[https://github.com/fkeck/subtools][subtools]].
