doc/journal.tex
% Created 2019-09-02 Mon 20:21
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{natbib}
\usepackage{minted}
\usepackage{mathtools}
\usepackage{amsfonts}
\author{Jason Cairns}
\date{\today}
\title{Main Dissertation Notes}
\hypersetup{
 pdfauthor={Jason Cairns},
 pdftitle={Main Dissertation Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Initial Survey}
\label{sec:org82ccb39}
\subsection{Prescribed Reading}
\label{sec:org54b4dca}
\begin{itemize}
\item \href{https://www.tidytextmining.com}{Text Mining with R}: \href{./text\_mining\_with\_r.org}{notes}
\item \href{https://m-clark.github.io/text-analysis-with-R/}{Text Analysis with R}
\end{itemize}
\subsection{Initial Consideration of Application Features}
\label{sec:orgf9bd8b1}
\textbf{UX/UI} must be intuitive, modelling the inherently non-linear workflow,
while fitting in with the iNZight / lite environment. I wrote some notes
on UX/UI \href{./ux\_ui.org}{here}.

\textbf{Text Classification} seems to be a hot topic in sentiment analysis, but
the question remains of whether it is within our scope (I suspect not).
If it were, \href{https://cran.r-project.org/web/packages/openNLP/}{openNLP}, along with some pre-made \href{https://datacube.wu.ac.at/src/contrib/}{models}, would likely serve 
this topic well. An interesting example of text classification in the
Dewey Decimal System is given \href{http://creatingdata.us/models/SRP-classifiers}{here}.

\textbf{\href{../reading/Thurner2015 - Understanding Zipfs Law of Word Frequencies through Sample Space Collapse in Sentence Formation.pdf}{Zipf's Law}} is referred to regularly in text analysis. Should we
demonstrate this directly, as part of some other analysis, or not at
all?

The \textbf{form of analysis} will vary enormously with different forms of
text. There are some things constant for all forms of text, but a good
deal is very specific. For example, the information of interest will
differ between novels, discourse (interviews, plays, scripts), twitter
posts, survey response data, or others. It may be worthwhile to either
focus solely on one, or give the option to specify the type of text.

\textbf{Data structures} will change based on the text type, and the packages
used. With a tidy dataframe as our base structure, it is easy enough to
convert to specific objects required by various packages, harder to
convert back.

There is a natural link between \textbf{text analysis and Linguistics}, and a
significant amount of the terminology in the field reflects that. Our
application requires far more market share than one that a mention in a
third year linguistics paper provides, and so linguistics is not going
to be our primary focus. Regardless, many forms of analysis require some
linguistic theory, such as those dependent on Part of Speech tagging, so
it is still worthwhile to keep in mind
\subsection{Twitter}
\label{sec:org0da32d5}
Twitter data looks particularly interesting, as it is a constantly
updating, rich source of information. I wrote up some notes on text
mining twitter \href{./text\_mining\_twitter.org}{here}. It would be particularly interesting to view
twitter data in the context of discourse analysis.
\subsection{Subtitles}
\label{sec:orgbecc54b}
Subtitles are a unique form of text that would be very interesting to
analyse. Subtitles for films and TV Series can be obtained easily from
the site \href{https://www.opensubtitles.org/en/search/subs}{opensubtitles}, though
obtaining subtitles programatically may be more difficult. It clearly is
possible, as VLC has an inbuilt feature, as does \href{https://github.com/zerratar/SubSync}{subsync}, which is written in
C\#, so would require a port to R (probably not worth it for us at this
point). Subtitles usually come as .srt files, and once the file is
obtained, it's easy enough to import and work with it in R with the
package \href{https://github.com/fkeck/subtools}{subtools}.
