doc/journal.org
** R Packages
[[https://quanteda.io/articles/pkgdown/comparison.html][Here]] is a useful comparison between the major text mining packages. CRAN also has
a [[https://cran.r-project.org/web/views/NaturalLanguageProcessing.html][task view]] specifically for Natural Language Processing, offering many
packages relevant to this project. Interestingly, they are split by
linguistic category; Syntax, Semantics, and Pragmatics. The further from
syntax the package is, the far more interesting it intuitively appears
(eg. word count vs sentiment analysis). Some packages of interest
include:

- [[https://github.com/juliasilge/tidytext][tidytext]] :: is a text-mining
  package using tidy principles, providing excellent interactivity with
  the tidyverse, as documented in the book
  [[https://www.tidytextmining.com][Text Mining with R]]
- [[http://tm.r-forge.r-project.org/][tm]] :: is a text-mining framework
  that was the go-to for text mining in R, but appears to have been made
  redundant by tidytext and quanteda of late
- [[https://quanteda.io/][quanteda]] :: sits alone next to qdap in the
  Pragmatics section of the NLP task view, and offers a similar
  capability to tidytext, though from a more object-oriented paradigm,
  revolving around /corpus/ objects. It also has extensions such as
  offering readability scores, something that may be worth implementing.
- [[https://trinker.github.io/qdap/vignettes/qdap_vignette.html][qdap]] ::  is a "quantitative discourse analysis package", an extremely rich set
  of tools for the analysis of discourse in text, such as may arise from
  plays, scripts, interviews etc. Includes output on length of discourse
  for agents, turn-taking, and sentiment within passages of speech. This
  looks to me like the most insight that could be gained from a text.
- [[https://github.com/trinker/sentimentr][sentimentr]] :: is a rich
  sentiment analysis and tokenising package, with features including
  dealing with negation, amplification, etc. in multi-sentence level
  analysis. An interesting feature is the ability to output text with
  sentences highlighted according to their inferred sentiment
- [[https://rstudio.github.io/dygraphs/][dygraphs]] :: is a time-series
  visualisation package capable of outputting very clear interactive
  time-series graphics, useful for any time-series in the text analysis
  module
- [[https://github.com/thomasp85/gganimate][gganimate]] :: produces  animations on top of the [[https://github.com/tidyverse/ggplot2][ggplot]] package, offering
  powerful insights. [[https://www.r-bloggers.com/investigating-words-distribution-with-r-zipfs-law-2/][Here]] is an example demonstrating Zipf's Law
- [[https://github.com/bnosac/textrank][textrank]] :: has the unique idea
  of extracting keywords automatically from a text using the pagerank
  algorithm (pagerank studied in depth in STATS 320) - my exploration of
  the package is documented [[./textrank_exploration.Rmd][here]]
- Packages for obtaining text:

  - [[https://cran.r-project.org/web/packages/gutenbergr/index.html][gutenbergr]] :: from Project Gutenberg
  - [[https://rtweet.info/][rtweet]] :: from Twitter
  - [[https://cran.r-project.org/web/packages/WikipediaR/index.html][wikipediar]] :: from Wikipedia

- [[https://github.com/EmilHvitfeldt/ggpage][ggpage]] :: produces impressive page-view charts with features such as
     word highlighting, allowing for a clear overview of a text and
     it's structure, with probable use in our search feature function

- [[https://github.com/thomasp85/gganimate][gganimate]] :: produces animated charts, which can be useful if
     additional, regular, and low /n/ dimensions exist in the data

--------------

Additionally, there are some packages that may not necessarily be useful
for the end user, but may help for our development needs. These
include:
- [[https://github.com/bnosac/udpipe][udpipe]] performs
tokenisation, parts of speech tagging (which serves as the foundation
for textrank), and more, based on the well-recognised C++
[[http://ufal.mff.cuni.cz/udpipe][udpipe library]], using the [[https://universaldependencies.org][Universal Treebank]]
- [[https://github.com/bnosac/BTM][BTM]] performs Biterm Topic Modelling,
which is useful for "finding topics in short texts (as occurs in short
survey answers or twitter data)". It uses a somewhat complex sampling
procedure, and like LDA topic modelling, requires a corpus for
comparison. Based on [[https://github.com/xiaohuiyan/BTM][C++ BTM]] 
- [[https://github.com/bnosac/crfsuite][crfsuite]] provides a modelling
framework, which is currently outside our current scope, but could be
useful later 
- In the analysis / removal of names, an important component of a text,
[[https://github.com/ironholds/humaniformat/][humaniformat]] is likely to be useful
- [[https://cran.r-project.org/web/views/WebTechnologies.html][CRAN Task View: Web Technologies and Services]] for importing texts from the
internet

** Other Text Analytics Applications
The field of text analytics applications is rather diverse, with most
being general analytics applications with text analytics as a feature of
the application. Some of the applications (general and specific) are
given:

- [[http://www.bnosac.be/index.php/products/txtminer][txtminer]] is a
  web app for analysing text at a deep level (with something of a
  linguistic focus) over multiple languages, for an "educated citizen
  researcher"
