doc/journal.tex
\subsection{R Packages}
\label{sec:org5b94177}
\href{https://quanteda.io/articles/pkgdown/comparison.html}{Here} is a useful comparison between the major text mining packages. CRAN also has
a \href{https://cran.r-project.org/web/views/NaturalLanguageProcessing.html}{task view} specifically for Natural Language Processing, offering many
packages relevant to this project. Interestingly, they are split by
linguistic category; Syntax, Semantics, and Pragmatics. The further from
syntax the package is, the far more interesting it intuitively appears
(eg. word count vs sentiment analysis). Some packages of interest
include:

\begin{description}
\item[{\href{https://github.com/juliasilge/tidytext}{tidytext}}] is a text-mining
package using tidy principles, providing excellent interactivity with
the tidyverse, as documented in the book
\href{https://www.tidytextmining.com}{Text Mining with R}
\item[{\href{http://tm.r-forge.r-project.org/}{tm}}] is a text-mining framework
that was the go-to for text mining in R, but appears to have been made
redundant by tidytext and quanteda of late
\item[{\href{https://quanteda.io/}{quanteda}}] sits alone next to qdap in the
Pragmatics section of the NLP task view, and offers a similar
capability to tidytext, though from a more object-oriented paradigm,
revolving around \emph{corpus} objects. It also has extensions such as
offering readability scores, something that may be worth implementing.
\item[{\href{https://trinker.github.io/qdap/vignettes/qdap\_vignette.html}{qdap}}] is a "quantitative discourse analysis package", an extremely rich set
of tools for the analysis of discourse in text, such as may arise from
plays, scripts, interviews etc. Includes output on length of discourse
for agents, turn-taking, and sentiment within passages of speech. This
looks to me like the most insight that could be gained from a text.
\item[{\href{https://github.com/trinker/sentimentr}{sentimentr}}] is a rich
sentiment analysis and tokenising package, with features including
dealing with negation, amplification, etc. in multi-sentence level
analysis. An interesting feature is the ability to output text with
sentences highlighted according to their inferred sentiment
\item[{\href{https://rstudio.github.io/dygraphs/}{dygraphs}}] is a time-series
visualisation package capable of outputting very clear interactive
time-series graphics, useful for any time-series in the text analysis
module
\item[{\href{https://github.com/thomasp85/gganimate}{gganimate}}] produces  animations on top of the \href{https://github.com/tidyverse/ggplot2}{ggplot} package, offering
powerful insights. \href{https://www.r-bloggers.com/investigating-words-distribution-with-r-zipfs-law-2/}{Here} is an example demonstrating Zipf's Law
\item[{\href{https://github.com/bnosac/textrank}{textrank}}] has the unique idea
of extracting keywords automatically from a text using the pagerank
algorithm (pagerank studied in depth in STATS 320) - my exploration of
the package is documented \href{./textrank\_exploration.Rmd}{here}
\item Packages for obtaining text:

\begin{description}
\item[{\href{https://cran.r-project.org/web/packages/gutenbergr/index.html}{gutenbergr}}] from Project Gutenberg
\item[{\href{https://rtweet.info/}{rtweet}}] from Twitter
\item[{\href{https://cran.r-project.org/web/packages/WikipediaR/index.html}{wikipediar}}] from Wikipedia
\end{description}

\item[{\href{https://github.com/EmilHvitfeldt/ggpage}{ggpage}}] produces impressive page-view charts with features such as
word highlighting, allowing for a clear overview of a text and
it's structure, with probable use in our search feature function

\item[{\href{https://github.com/thomasp85/gganimate}{gganimate}}] produces animated charts, which can be useful if
additional, regular, and low \emph{n} dimensions exist in the data
\end{description}

\noindent\rule{\textwidth}{0.5pt}

Additionally, there are some packages that may not necessarily be useful
for the end user, but may help for our development needs. These
include:
\begin{itemize}
\item \href{https://github.com/bnosac/udpipe}{udpipe} performs
\end{itemize}
tokenisation, parts of speech tagging (which serves as the foundation
for textrank), and more, based on the well-recognised C++
\href{http://ufal.mff.cuni.cz/udpipe}{udpipe library}, using the \href{https://universaldependencies.org}{Universal Treebank}
\begin{itemize}
\item \href{https://github.com/bnosac/BTM}{BTM} performs Biterm Topic Modelling,
\end{itemize}
which is useful for "finding topics in short texts (as occurs in short
survey answers or twitter data)". It uses a somewhat complex sampling
procedure, and like LDA topic modelling, requires a corpus for
comparison. Based on \href{https://github.com/xiaohuiyan/BTM}{C++ BTM} 
\begin{itemize}
\item \href{https://github.com/bnosac/crfsuite}{crfsuite} provides a modelling
\end{itemize}
framework, which is currently outside our current scope, but could be
useful later 
\begin{itemize}
\item In the analysis / removal of names, an important component of a text,
\end{itemize}
\href{https://github.com/ironholds/humaniformat/}{humaniformat} is likely to be useful
\begin{itemize}
\item \href{https://cran.r-project.org/web/views/WebTechnologies.html}{CRAN Task View: Web Technologies and Services} for importing texts from the
\end{itemize}
internet

\subsection{Other Text Analytics Applications}
\label{sec:org0ede293}
The field of text analytics applications is rather diverse, with most
being general analytics applications with text analytics as a feature of
the application. Some of the applications (general and specific) are
given:

\begin{itemize}
\item \href{http://www.bnosac.be/index.php/products/txtminer}{txtminer} is a
web app for analysing text at a deep level (with something of a
linguistic focus) over multiple languages, for an "educated citizen
researcher"
\end{itemize}
