doc/journal.org
** Scope Determination
The scope of the project is naturally limited by the amount of time
available to do it. As such, exploration of topics such as discourse
analysis, while interesting, is beyond the scope of the project.
Analysis of text must be limited to regular texts, and comparisons
between them. The application must give the greatest amount of insight
to a regular user, in the shortest amount of time, into what the text is
actually about.

[[http://usresp-student.shinyapps.io/text_analysis][Cassidy's project]] was intended to create this, and I have written
notes on it [[./cassidy_notes.org][here]].

Ultimately, I am not completely sold on the idea that term frequencies
and other base-level statistics really give that clear a picture of what
a text is about. It can give some direction, and it can allow for broad
classification of works (eg. a novel will usually have character names
at the highest frequency ranks, scientific works usually have domain
specific terms), but I think word frequencies are less useful to the
analyst than to the algorithms they feed into, such as tf-idf, that may
be more useful. As such, I don't think valuable screen space should be
taken up by low-level statistics such as term frequencies. To me, the
situation is somewhat akin to [[https://en.wikipedia.org/wiki/Anscombe's_quartet][Anscombe's Quartet]], where the base 
statistics leave a good deal of information out, term frequencies being 
analogous to the modal values.

Additionally, sentiment is really just one part of determining the
semantics of a text. I think too much focus is put on sentiment, which
in practice is something of a "happiness meter". I would like to include
other measurement schemes, such as readability, formality, etc.

Some kind of context in relation to the universal set of texts would be
ideal as well, I think a lot of this analysis occurs in a vacuum, and
insights are hard to come by - something like Google n-grams would be
ideal.

I'm picturing a single page, where the analyst can take one look and
have a fair idea of what a text is about. In reality it will have to be
more complex than that, but that is my lead at the moment. With this in
mind, I want to see keywords, more on /structure/ of a text, context,
and clear, punchy graphics showing not /just/ sentiment, but several
other key measurements.

* Initial Feature Considerations
** Introduction
The application essentially consists of a feature-space, with the area
being divided in three; [[*Processing][Processing]], [[*Within-Text Analytics][Within-Text Analytics]], and
[[*Between-Text Analytics][Between-Text Analytics]]. This follows the general format of much of
what is capable in text analysis, and what is of interest to us and our
end users. The UI will likely reflect this, dividing into seperate
windows/panes/tabs to accomodate. Let's look at them in turn:
** Processing
In order for text to be analysed, it must be imported and processed. A
lot of this is an iterative process, coming back for further processing
after analysis etc. Importing will have a "type" selection ability for
the user, where they can choose from a small curated list of easy-access
types, such as gutenberg search, twitter, etc. The option for a custom
text-type is essential, allowing .txt, and for the particularly advanced
end-user, .csv.

Once the file is imported/type is downloaded, the option should exist to
allow the specification of divisions in the text. In a literary work,
these include "chapter", "part", "canto", etc. A twitter type would
allow division by author, by tweet, etc. An important aspect of this
processing is to have a clear picture of what the data should look like.
Division of a text should be associated with some visualisation of the
resulting structure of the text, such as a horizontal bar graph showing
the raw count of text (word count) for each division - this would allow
immediate insight into the correctness of the division, by sighting
obvious errors immediately, and allowing fine tuning so that, for
example, the known number of chapters match up with the number of
divisions. We could implement a few basic division operators in regex,
while following the philosophy of allowing custom input if wanted.
Example regex for "Chapter" could be
=/[Cc]hapter[.:]?[   ]{0,10}-?[  ]{0,10}([0-9]|[ivxIVX]*))/g=, something
the end user is likely not wanting to input themselves.

Removal and transformation is another important processing step for
text, with stopwords and lemmatisation being invaluable. The option
should exist to remove specific types of words, which can again come
from prespecified lists. An aspect worth considering is if this should
be done in a table manipulation, or a model - or both, with the length
of the text deciding automatically based on sensible defaults. Again,
the need for a clear picture of the data is essential, with some visual
indication of the data during transformation and removal essential; this
could take the form of some basic statistics, such as a ranking of terms
by frequencies, and some random passage chosen.

Processing multiple documents is also essential. The importation is
something that has to be got right, otherwise it'll be more complex than
it already is, and the end-user will lose interest before the show even
begins. My initial thoughts are of a tabbed import process, with each
tab holding the processing tasks for each individual document, however
this won't scale well to large corpus imports.

** Within-Text Analytics
Within-text analytics should have options to look at the whole text as
it is, whether to look by division, or whether to look at the entire
imported corpus as a whole.

A killer feature here is the production of a summary; a few key
sentences that summarise the text. It's a case of using text to describe
text, but done effectively, it has the potential to compress a large
amount of information into a small, human-understandable object.

Related to the summary, keywords in the text will give a good indication
of topics and tone of the text, as well as perhaps more grammatical
notions, such as authorial word choices. There is the possibility of
using keywords as a basis for other features, such as the ability to use
a search engine to find related texts from the keywords.

Bigrams and associated terms are also excellent indicators of a text.
Something I particularly liked in Cassidy's project was the ability to
search for a term, and see what was related to it. In that case, the
text was "Peter Pan", and searching for a character's name yielded a
wealth of information of the emotions and events attached to the
character.

Sentiment is a feature that has been heavily developed by the field of
text analytics, seeing a broad variety of uses. here, it would be worth
examining sentiment, by word and over the length of the text overall.

** Between-Text Analytics
As in within-text analytics, between-text analytics should have
options for specifying the component of the text that is of interest;
here, the two major categories would be comparisons between divisions
within an individual text, and comparisons between full texts.

Topic modelling gives an idea of what some topics are between texts -
something odd to me is that there isn't a huge amount of information on
topic modelling purely within a text, it always seems to be between
texts (LDA etc.)

tf-idf for a general overview of terms more or less unique to different
texts.

Summarisation between all texts would also be enormously useful.

