doc/journal.org
** Stopwords
After noting that stopword removal impacted important n-grams when a
stopword made up some component of the n-gram, it becomes very
worthwhile to not only include an active capacity to view what current
stopwords exist, but also to have alternative lists of stopwords. The
following summarises some research into stopwords and common practices
around them;

- StackOverflow removes the top 10,000 most common english words in
  "related queries" for their SQL search engine
  (https://stackoverflow.blog/2008/12/04/podcast-32/)
- The [[https://github.com/quanteda/stopwords][stopwords]] =R= package includes several lists of stopwords. Among
  these, of note are:
  - [[http://www.ai.mit.edu/projects/jmlr/papers/volume5/lewis04a/a11-smart-stop-list/english.stop][SMART]]: The stopword lists based on the SMART (System for the
    Mechanical Analysis and Retrieval of Text)Information Retrieval
    System, an information retrieval system developed at Cornell
    University inthe 1960s.
  - [[http://snowball.tartarus.org/algorithms/english/stop.txt][snowball]]: It is a small string processing language designed for
    creating stemming algorithms for use in Information Retrieval.
  - [[https://github.com/stopwords-iso/stopwords-iso/blob/master/stopwords-iso.json][iso]]: The most comprehensive stopwords for any language

The package we are using extensively, tidytext, has both SMART and
snowball lists, as well as [[http://www.lextek.com/manuals/onix/stopwords1.html][onix]], which bills itself as " probably the
most widely used stopword list. It covers a wide number of stopwords
without getting too aggressive and including too many words which a
user might search upon." Of note is that all of the lists are included
in one dataframe, so it should be filtered before being used, unlike
how we have been using it. snowball is clearly the shortest, and I
think may be worth having as the default, with SMART (the most
extensive) and onix as secondary options. We are not in the role of
providing a computationally efficient search engine, only removing
words that contribute little but noise.

In terms of implementation within our program, we ought to have the
ability to add custom stopwords. In keeping with the philosophy of
having our data clearly visible, this will necessitate a "temporary
stopwords" list. In the process of implementation, we will have to
make assesments of whether it will run too slowly if allowed to
influence charts and output in real timme, so manual refreshes would
be required. Additionally, it will be good to have a running set of
statistics keeping available what has been done to the data (including
more than just stopword removal)
** Visualisation
With so much of the conceptual space of text analytic visualisation
being taken up with far from optimal charts, there is a need to
experiment with alternative visualisations; We explore some [[file:sent-vis.org][here]]
** Text Summarisation
[[https://en.wikipedia.org/wiki/Automatic_summarization][Wikipedia: Automatic Summarisation]]

Text summarisation creates enormous insight, especially from a long
text. There are a variety of different techniques, of varying
effectiveness and efficiency. A famous example of automatic text
summarisation comes from [[https://www.reddit.com/user/autotldr][autotoldr]], a bot on reddit that automatically
generates summaries of news articles in 4-5 sentences. Autotldr is
powered by [[https://smmry.com/about][SMMRY]], which explains it's algorithm as working through the
following steps:

1. Associate words with their grammatical counterparts. (e.g "city"
   and "cities")
2. Calculate the occurrence of each word in the text.
3. Assign each word with points depending on their popularity.
4. Detect which periods represent the end of a sentence. (e.g "Mr."
   does not).
5. Split up the text into individual sentences.
6. Rank sentences by the sum of their words' points.
7. Return X of the most highly ranked sentences in chronological
   order.

The two main approaches to automatic summarisation are extractive and
abstractive; *Extractive* uses some subset of the original text to
form a summary, while *abstractive* techniques form semantic
representations of the text. Here, we will stick to the clearer,
simpler, extractive techniques for now.

[[https://github.com/bnosac/textrank][textrank]] has the unique idea of extracting keywords automatically from
a text using the pagerank algorithm (pagerank studied in depth in
STATS 320) - my exploration of the package is documented [[./textrank_exploration.Rmd][here]]. At
present, the R implementation of it creates errors for large text
files, but it is worth exploring more into it - whether it is the
implementation, or if it is the algorithm itself.

Hvidfeldt is a prolific blogger focussing on text analysis - he put up
this tutorial on incorporating textrank with tidy methods: [[https://www.hvitfeldt.me/blog/tidy-text-summarization-using-textrank/][tidy
textRank]]

Further summarisation experimentation is continued [[file:summarisation_experimentation.Rmd][here]]

After further testing, I have found LexRank to work significantly
faster, while generating similar results, thus being favourable for
summarisation. It appears that Textrank wins in the ability to
generate keywords, and does so extremely quickly. Despite the speed
gain in using LexRank for summarisation, it still takes several
seconds on my i5 dual-core, to run, however this is offset by the
verbosity of the function assuring me that it isn't hanging.

LexRank and textRank appear to exist complimentarily to one another.
Below is a brief summary of how they work

*** TextRank

TextRank essentially finds the most representative sentence of a text
based on some similarity measure to other sentence.

By dividing a text into sentences, measures of similarity between every
sentence is calculated (by any number of possible similarity measures),
producing an adjacency matrix of a graph with nodes being sentences,
edge weights being similarity. The PageRank algorithm is then run on
this graph, deriving the best connected sentences, and thereby the most
representative sentences. A list is produced giving sentences with their
corresponding PageRank. The top $n$ sentences can be chosen, then output
in chronological order, to produce a summary.

In the generation of keywords, the same process described is typically
run on unigrams, with the similarity measure being co-occurance.

*** LexRank
    :PROPERTIES:
    :CUSTOM_ID: lexrank
    :END:

LexRank is essentially the same as textRank, however uses
[[https://en.wikipedia.org/wiki/Cosine_similarity][cosine similarity]] of tf-idf vectors as it's measure of similarity. LexRank is better at
working across multiple texts, due to the inclusion of a heuristic known
as "Cross-Sentence Information Subsumption (CSIS)"
** Search Function
The analyst is not expected to be entirely familiar with the texts
under analysis; this is partly the purpose of this program. Hence,
there are likely to be terms, keywords, and relationships that the
program reveals, and are a surprise to the analyst, and context is
necessary to understand them. A search function has been identified as
useful in meeting this problem, where a word is entered in search, and
contextual passages are returned. Useful in the results would be
indications of location of each passage in the greater text, as well
as if multiple texts are present, the name of the text it belongs to.

