doc/journal.org
** Topic Modelling
Topic Modelling appears to serve a useful purpose in text analytics,
with LDA being the primary implementation, requiring multiple texts,
and a Document-Term Matrix. My exploration with topic modelling is
located [[file:topic-modelling.Rmd][here]]. It could be worth investigating other forms of topic
modelling, especially within-text.

[2019-05-17 Fri] I checked other forms - their complexity requires a
great deal of time to understand if I want to implement them
intelligently; better to stick with LDA, which, while also complex, is
well used enough to be considered standard.
** Sentiment Distribution
Over a large /n/ dataset such as free-response surveys, it may be
useful to calculate the sentiment for each response, and consider the
statistical properties of the distribution of sentiments. [[file:sent-dist.org][Here]] is an
exploration of free-response data forming a sentiment distribution.
** Conditional Analytics
The idea of conditional analytics is of interest to me, especially for
high /n/ datasets such as large free-response surveys. Particularly, I
want to know, given some condition, how does the subset behave? For
example, [[file:sent-dist.org][given]] a negative sentiment, what is the most representative
response? Or, given that some common word, what is the distribution of
sentiment
** Wrapper Functions
In order to begin implementation, I have defined wrapper functions for
the primary features. The intention is to create a higher layer of
abstraction for the features as well as ease of use. I begin with the
text summarisation feature; the details are below
*** Text Summarisation
Link to [[file:~/curr/stats-781/src/summ-wrapper.R][src]]
Link to [[file:~/curr/stats-781/test/summ-wrapper-test.R][test]]
Arguments:
- x = input dataframe with column titled "word"
- n = n-many sentences
- style = style of output (chart, dataframe, text)
- dim = dimension of chart
- engine = textrank/lexrank
- type = sentences/keywords etc.

Working through, I have come to come realisation that a complete
wrapper function may not necessarily be ideal; rather, a pipeline may
be better - this is because a wrapper function, with, e.g., a plotting
function at the outermost layer, would require a full recalculation of
the inner functions for every parameter change in the plot - what may
be better is the creation of a pipeline that leaves most functions as
they are but just creates more suitable objects to pass as arguments
to the functions. This is something of a "memory cheap; processing
expensive" principle. The display wrapper functions would then be
taking complete objects only 

<2019-05-22 Wed> Chris clarified the role of wrappers here being more
of a "layer" level, layers being:
- word/n-gram;
  - Word frequency
  - Bigram frequency
  - pairwise word correlations
  - textrank keywords
- sentence;
  - textrank
  - lexrank
- topic level
- sentiment level
** Visualisation
 Visualisation of text is proving to be a more complex area than I
 first assumed. Prior to this project, the only visualisation I knew of
 was word clouds, which I have come to understand to be about as
 useless as an unlabelled pie chart.

 Text visualisation is essentially the attempt to efficiently relay
 insights gained from text analytics. In the
 preparation-insight-visualisation layers, it is the final layer.
 Visualisation is not limited to just charts; for our purposes, a well
 crafted and formatted table may be just as good at conveying
 information.

 The form of the insight determines the form of the visualisation. So
 far, insights all give a "score". Thus, the visualisation, showing a
 mapping between a text (categorical) and a numerical insight
 (numberical) varaiable, can only take a few forms, ideally showing the
 relative scores and ranking of specific text items, or a distribution
 of the entire set.

 At base, nearly everything is neatly categorical-numeric, able to be
 represented by bars/lollipops.

 Pairwise correlation is slightly different, being a numerical function
 of two categorical arguments; best represented in either a searchable
 table, or a correlation matrix

 Getting more advanced, for small data, ggpage type visualisations will
 be excellent for sentiment and word/bigram frequency, as well as
 ranking keywords.

 Finally, when grouping is implemented, colouring or facetting by group
 will be what makes this analysis package better than any competitors.

 [2019-07-01 Mon] After implementing grouping, the issue with arranging
 bars in a barplot by rank within each group is that ggplot arranges
 bars through the ordering of factor levels. The problem is that each
 instance of a word in every group shares the same level ordering, so
 while a word may rank highly overall, but less than others in a
 particular group, it will retain the high ordering overall in the
 facet for that group, leading to inaccuracies.

