doc/journal.org
** ggpage
ggpage is an extension to ggplot to allow the rendering of text in a
page-like representation as a manipulable image. 
Example
#+begin_src R :results value :colnames yes :hline yes :session rsession1 :tangle no :comments link :exports both :eval never-export
library(tidyverse)
library(ggpage)
head(tinderbox)
#+end_src

#+RESULTS
# A tibble: 6 x 2
  text                                                              book        
  <chr>                                                             <chr>       
1 "A soldier came marching along the high road: \"Left, right - le… The tinder-…
2 had his knapsack on his back, and a sword at his side; he had be… The tinder-…
3 and was now returning home. As he walked on, he met a very frigh… The tinder-…
4 witch in the road. Her under-lip hung quite down on her breast, … The tinder-…
5 "and said, \"Good evening, soldier; you have a very fine sword, … The tinder-…
6 knapsack, and you are a real soldier; so you shall have as much … The tinder-…

ggpage can make immediate plots, but using =ggpage_build= and
=ggpage_plot=, complex functions can be formed in the immediate
representation from build before plotting. The representation takes
the following form:
#+begin_src R :results output :colnames yes :hline yes :session rsession1 :tangle no :comments link :exports both :eval never-export
tinderbox %>%
  ggpage_build() 
#+end_src

#+RESULTS:
# A tibble: 2,908 x 9
   word     book            page  line  xmin  xmax  ymin  ymax index_line
   <chr>    <chr>          <int> <int> <dbl> <dbl> <dbl> <dbl> <chr>     
 1 a        The tinder-box     1     1    91    90  -114  -117 1-1       
 2 soldier  The tinder-box     1     1    99    92  -114  -117 1-1       
 3 came     The tinder-box     1     1   104   100  -114  -117 1-1       
 4 marching The tinder-box     1     1   113   105  -114  -117 1-1       
 5 along    The tinder-box     1     1   119   114  -114  -117 1-1       
 6 the      The tinder-box     1     1   123   120  -114  -117 1-1       
 7 high     The tinder-box     1     1   128   124  -114  -117 1-1       
 8 road     The tinder-box     1     1   133   129  -114  -117 1-1       
 9 left     The tinder-box     1     1   138   134  -114  -117 1-1       
10 right    The tinder-box     1     1   144   139  -114  -117 1-1       
# … with 2,898 more rows

This is set up solely for novels, and there is no way yet to implement
grouping (as at ggpage v0.2.2.9000), but this may be useful. ggpage
requires the scoring to be defined within the ggpage_build dataframe
form - we can make use of this if we apply the insight functions to
it. Entirely coincidentally, we have used precisely the same naming
conventions for the input dataframe to ggpage_build (column named
'text'), and the insight functions inside ggpage_build (working on
column named "word"). Some tests are given in the test file. The
primary issue with using ggpage is that the insight is applied as a
/part/ of the visualisation, rather than being seperate to it, as with
all the others.
* Initial Data Types Survey
The application requires the capacity to smoothly work with diverse
data types. For this to occur, a test corpus must be developed, and
some important data types picked out.
** Test Corpus
It is essential to test on a broad variety of texts in order to create
the most general base application, so a "test set" will have to be
developed. All data is stored in the folder [[file:c:/Users/User/Desktop/stats-781/data][data]]

*Must have*

- Literature (eg. Dante's Divine Comedy)
- Survey response data (eg. nzqhs, Cancer Society)
- Transcript; lack of punctuation may cause difficulties in processing
  sentences.
- Twitter

*Would be nice*

- article
  - journal (scientific, social)
  - news
  - blog
  - wikipedia
- discourse
  - interview
  - subtitles
- documentation
  - product manual
  - technical user guide

** Free-Response Data
Free Response Data (as in survey forms etc.) has been identified as an
area of high potential for the application. Two datasets have been
used to run typical text analyses upon, with the exploration [[file:free-response.Rmd][here]].
Upon close inspection, there are subtleties worth exploring [[file:further-free-response.org][further]]
especially in bigrams and keywords.
** Data types for implementation
In the production of wrapper functions, we require data types that
work well with all functions that are required. For the purpose of
word-level summarisation, the following features require functions with the
associated data types as arguments:
- Word frequency: =tidytext::unnest_tokens=
  - @param tbl: A data frame
- Bigram frequency: =tidytext::unnest_tokens=
  - @param tbl: A data frame
- pairwise word correlations: =widyr::pairwise_cor=
  - @param tbl: Table
  - @param: item: Item to compare; will end up in ‘item1’ and ‘item2’
    columns
  - @param feature: Column describing the feature that links one item
    to others
- textrank keywords: =textrank::textrank_keywords=
  - @param x: a character vector of words.

Thinking even earlier in the pipeline, the processing section requires
functions to remove stopwords- this requires =tidytext::unnest_tokens=
again, meaning a dataframe. The issue is that if we operate on groups,
then we require a function that takes a vector as argument. Perhaps
more thought is needed in understanding what grouped operations should
look like in text analytics. Alternatively, we could create a function
that takes a dataframe as input, with the option to name groups to
perform group operations upon. 

Another issue that arises is the elimination of sentences and
structure upon the unnesting of tokens. What may be worthwhile is to
create a dataframe such as the following:

| grouping vars | ... | doc_id | paragraph_id | sentence_id | word_id | word |
|---------------+-----+--------+--------------+-------------+---------+------|
|               |     |        |              |             |         |      |

In which case, we should start at the very beginning, looking at text
import wrapper functions, enabling them to output a dataframe of this
type such that the remaining process is entirely predictable.

Current files for wrappers:
[[file:~/curr/stats-781/src/prep-for-insight.R][prep-for-insight.R]]

Note: [2019-06-10 Mon]: determined that line number is more general
than paragraph: paragraph can be inferred from line number.

As @ [2019-06-13 Thu], I have found the dataframe form as described
prior to be extremely valuable. The implementation of all wrappers
should have as the aim to preserve the structure as much as possible,
only adding additional columns to the dataframe resulting from the
function.
