doc/journal.tex

\subsection{ggpage}
\label{sec:org3a3ee9a}
ggpage is an extension to ggplot to allow the rendering of text in a
page-like representation as a manipulable image. 
Example
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
library(tidyverse)
library(ggpage)
head(tinderbox)
\end{minted}

\#+RESULTS

  text                                                              book        
  <chr>                                                             <chr>       
1 "A soldier came marching along the high road: $\backslash$"Left, right - le… The tinder-…
2 had his knapsack on his back, and a sword at his side; he had be… The tinder-…
3 and was now returning home. As he walked on, he met a very frigh… The tinder-…
4 witch in the road. Her under-lip hung quite down on her breast, … The tinder-…
5 "and said, $\backslash$"Good evening, soldier; you have a very fine sword, … The tinder-…
6 knapsack, and you are a real soldier; so you shall have as much … The tinder-…

ggpage can make immediate plots, but using \texttt{ggpage\_build} and
\texttt{ggpage\_plot}, complex functions can be formed in the immediate
representation from build before plotting. The representation takes
the following form:
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
tinderbox %>%
  ggpage_build() 
\end{minted}

   word     book            page  line  xmin  xmax  ymin  ymax index\textsubscript{line}
   <chr>    <chr>          <int> <int> <dbl> <dbl> <dbl> <dbl> <chr>     
 1 a        The tinder-box     1     1    91    90  -114  -117 1-1       
 2 soldier  The tinder-box     1     1    99    92  -114  -117 1-1       
 3 came     The tinder-box     1     1   104   100  -114  -117 1-1       
 4 marching The tinder-box     1     1   113   105  -114  -117 1-1       
 5 along    The tinder-box     1     1   119   114  -114  -117 1-1       
 6 the      The tinder-box     1     1   123   120  -114  -117 1-1       
 7 high     The tinder-box     1     1   128   124  -114  -117 1-1       
 8 road     The tinder-box     1     1   133   129  -114  -117 1-1       
 9 left     The tinder-box     1     1   138   134  -114  -117 1-1       
10 right    The tinder-box     1     1   144   139  -114  -117 1-1       

This is set up solely for novels, and there is no way yet to implement
grouping (as at ggpage v0.2.2.9000), but this may be useful. ggpage
requires the scoring to be defined within the ggpage\textsubscript{build} dataframe
form - we can make use of this if we apply the insight functions to
it. Entirely coincidentally, we have used precisely the same naming
conventions for the input dataframe to ggpage\textsubscript{build} (column named
'text'), and the insight functions inside ggpage\textsubscript{build} (working on
column named "word"). Some tests are given in the test file. The
primary issue with using ggpage is that the insight is applied as a
\emph{part} of the visualisation, rather than being seperate to it, as with
all the others.
\section{Initial Data Types Survey}
\label{sec:orgbe7fb9e}
The application requires the capacity to smoothly work with diverse
data types. For this to occur, a test corpus must be developed, and
some important data types picked out.
\subsection{Test Corpus}
\label{sec:org4cae160}
It is essential to test on a broad variety of texts in order to create
the most general base application, so a "test set" will have to be
developed. All data is stored in the folder \href{c:/Users/User/Desktop/stats-781/data}{data}

\textbf{Must have}

\begin{itemize}
\item Literature (eg. Dante's Divine Comedy)
\item Survey response data (eg. nzqhs, Cancer Society)
\item Transcript; lack of punctuation may cause difficulties in processing
sentences.
\item Twitter
\end{itemize}

\textbf{Would be nice}

\begin{itemize}
\item article
\begin{itemize}
\item journal (scientific, social)
\item news
\item blog
\item wikipedia
\end{itemize}
\item discourse
\begin{itemize}
\item interview
\item subtitles
\end{itemize}
\item documentation
\begin{itemize}
\item product manual
\item technical user guide
\end{itemize}
\end{itemize}

\subsection{Free-Response Data}
\label{sec:org2e6e4c9}
Free Response Data (as in survey forms etc.) has been identified as an
area of high potential for the application. Two datasets have been
used to run typical text analyses upon, with the exploration \href{free-response.Rmd}{here}.
Upon close inspection, there are subtleties worth exploring \href{further-free-response.org}{further}
especially in bigrams and keywords.
\subsection{Data types for implementation}
\label{sec:org713af5e}
In the production of wrapper functions, we require data types that
work well with all functions that are required. For the purpose of
word-level summarisation, the following features require functions with the
associated data types as arguments:
\begin{itemize}
\item Word frequency: \texttt{tidytext::unnest\_tokens}
\begin{itemize}
\item @param tbl: A data frame
\end{itemize}
\item Bigram frequency: \texttt{tidytext::unnest\_tokens}
\begin{itemize}
\item @param tbl: A data frame
\end{itemize}
\item pairwise word correlations: \texttt{widyr::pairwise\_cor}
\begin{itemize}
\item @param tbl: Table
\item @param: item: Item to compare; will end up in ‘item1’ and ‘item2’
columns
\item @param feature: Column describing the feature that links one item
to others
\end{itemize}
\item textrank keywords: \texttt{textrank::textrank\_keywords}
\begin{itemize}
\item @param x: a character vector of words.
\end{itemize}
\end{itemize}

Thinking even earlier in the pipeline, the processing section requires
functions to remove stopwords- this requires \texttt{tidytext::unnest\_tokens}
again, meaning a dataframe. The issue is that if we operate on groups,
then we require a function that takes a vector as argument. Perhaps
more thought is needed in understanding what grouped operations should
look like in text analytics. Alternatively, we could create a function
that takes a dataframe as input, with the option to name groups to
perform group operations upon. 

Another issue that arises is the elimination of sentences and
structure upon the unnesting of tokens. What may be worthwhile is to
create a dataframe such as the following:

\begin{center}
\begin{tabular}{lllllll}
grouping vars & \ldots{} & doc\textsubscript{id} & paragraph\textsubscript{id} & sentence\textsubscript{id} & word\textsubscript{id} & word\\
\hline
 &  &  &  &  &  & \\
\end{tabular}
\end{center}

In which case, we should start at the very beginning, looking at text
import wrapper functions, enabling them to output a dataframe of this
type such that the remaining process is entirely predictable.

Current files for wrappers:
\href{file:///home/user/curr/stats-781/src/prep-for-insight.R}{prep-for-insight.R}

Note: \textit{[2019-06-10 Mon]}: determined that line number is more general
than paragraph: paragraph can be inferred from line number.

As @ \textit{[2019-06-13 Thu]}, I have found the dataframe form as described
prior to be extremely valuable. The implementation of all wrappers
should have as the aim to preserve the structure as much as possible,
only adding additional columns to the dataframe resulting from the
function.
