doc/journal.org
*** Text Analytics wrappers
 [2019-05-29 Wed]: Chris approved the datatype. Work will begin on the
 wrappers, using this datatype. He raised the very valid point on how
 pairwise corelations between words should possibly use groups as
 their similarity component, rather than sentences. e.g., correlation
 of words between survey responses. *note: groups are always nested,
 and conditioning is actually filtering*

Important to note: Different punctuation marks exist, and despite some
visual similarities, are not recognised as equivalent on the computer:
for example, "’" and "'" are different. Selecting "alice's" as a
stopword will not filter out "alice’s". While on the topic, it may be
worthwhile to incorporate regex ability for the application. CLI
integration would be a dream, but not so useful for school and
undergraduate students.

* Initial Considerations of Program Structure
**  [2019-06-13 Thu] Notes
  - Read [[http://r-pkgs.org][r-pkgs.org]]. Notes: A working prototype will be built before
    formally packaging it; this is to allow for greater flexibility and
    experimentation without worry about breaking the package structure.
    All the source code for functions are located in the src folder,
    grouped according to their functional category.
  - Further intentions: a rigorous, clean implementation of grouping and
    conditioning (generalised as filtering) is something I believe to be
    important to make this package stand out from the crowd. Upon the
    function set all working, I think this would be worth pursuing. The
    structure of the internal datatype has been kept specifically so
    that grouping and filtering are efficient, lossless, and simple
    operations.
Dataframe form:

| grouping vars | ... | doc_id | paragraph_id | sentence_id | word_id | word |
|---------------+-----+--------+--------------+-------------+---------+------|
|               |     |        |              |             |         |      |
** [2019-07-10 Wed] Notes
I have done some further thinking today, especially
following the meeting yesterday; destructive edits to the text are a
serious problem to the integrity of the text, where all insight
actions require starting from scratch as soon as any different types
of input are needed. An example stems from experimenting with ggpage and
realising that when stopwords are removed, the structure of the text
is heavily hollowed out. After some thought, my solution is the following;

*Processing*: Start with the importation and formatting of text,
 keeping every single word and it's identification, down to the
 capitalisation. Further options include (for example) lemmatisation,
 and stopwords. In keeping with the spirit of non-destructive edits,
 each add a column: lemmatisation adds a lemmatised form of row's
 word, and stopwords adds a boolean value regarding the status of the
 lemma. A final processing function creates a new row for the insight to be
 performed on, based on the processing options (to use lemmas,
 stopwords etc.). Groups are then declared.

*Insights* looks for the insight column, and adds some output column
 based upon it. The only changes I will have to make to the existing
 functions will be to look for the insight column. A potential
 difficulty is that they will have to be capable of dealing with
 missing values (now that stopwords are just removed with NA in place)

*Visualisations* will be exactly the same. A new, neat bit will be
 that ggpage is simply a case of =ggpage_build= of the original import
 and a =cbind=, then =ggpage_plot(aes(fill = insight))=.

(End of Solution) In addition, I have been thinking about UI. Shiny
apps often have a paged, scrolling structure like a webpage, but I
think text analytics may require a different format, due to the
continual return to the processing stage, as well as the large amount
of processing required for many operations, thus leading to slow,
laggy pages. I think the "SAS format" may be a winning formula, where
tickboxes, radios, and inputs on one high level page are tweaked, then
a button is pressed to produce the output. This would lend itself
really well to going back and tweaking, as well as the feature of code
generation. It obeys the KISS principle, which wins it points in my
book. 

Preparation is now divided into importation, grouping, formatting,
then processing. In detail:
- Import :: bringing in text from various formats, convert to simple table
- Group :: section text by groups, for which later operations will be uniquely performed on
- Format :: format the text into a standard object that can be operated on
- Process :: remove stopwords, lemmatise, filter, other lossy transformations
** Note on Non-Destructive Editing
 Destructive editing is the practice where the original input can't be
 attained after the transformation. It is non-Injective, and
 non-invertible. Thus, when certain changes are required, an earlier
 state is needed. Tidytext has made the decision to encourage
 destructive edits, which is acceptable when the user is a programmer
 with full control over every possible variable assignment, but not for
 a GUI user. Hence, we have made the explicit decision to have
 non-destructive transformations only, after hitting repeated
 roadblocks related to Destructive edits. Memory is cheap for
 computers, and summarisation functions can always be delayed, to
 retain as much information, as many degrees of freedom as possible.
 The concept of nondestructive edits is not new; graphic design relies
 upon it, with an example given for photoshop at the [[https://helpx.adobe.com/photoshop/using/nondestructive-editing.html][Adobe Website]]
** [2019-07-25 Thu] Notes
Present thoughts on visualisation: It should be a manual process, with
intentionality behind it, rather than scrolling through pre-made
visualisations. This would require (i.e. make clear) a function that
takes specifications of x, y, facets etc.
* Program Dependencies
The following code is to enable tibbles internally in the package
#+begin_src R :session rsession1 :tangle ~/inzightta/R/inzightta-package.R :eval never-export :exports both
## usethis namespace: start
#' @importFrom tibble tibble
## usethis namespace: end
NULL
#+end_src

I am considering using [[https://davisvaughan.github.io/furrr/][furrr]] for parallel or distributed processing
performance enhancements, though I want to get all functionality
implemented first before performing that kind of optimisation.
** Helper Functions
*** Unrestricted if-expression
Having conditionals as expressions rather than statements grants the
ability for direct assignment of the evaluation. Base =ifelse= and
tidyverse =dplyr::if_else= impose the restriction that the output is the same
shape as the test predicate. This helper removes that restriction
#+begin_src R :session rsession1 :tangle ~/inzightta/R/utils.R :eval never-export :exports both
  #' scheme-like if expression, without restriction of returning same-size table of .test, as ifelse() does
  #'
  #' @param .test predicate to test
  #'
  #' @param true expression to return if .test evals to TRUE
  #'
  #' @param false expression to return if .test evals to TRUE
  #'
  #' @return either true or false
  ifexp <- function(.test, true, false){
    if (.test) {
      return(true)
    } else {
      return(false)
    }
  }
#+end_src
