doc/journal.org
*** Filetype from extension
A helper function to attain the document filetype from the file name.
#+begin_src R :session rsession1 :tangle ~/inzightta/R/utils.R :eval never-export :exports both
  #' Get filetype
  #'
  #' @param filepath string filepath of document
  #'
  #' @return filetype (string) - NA if no extension
  get_filetype <- function(filepath){
    filepath %>%
      basename %>%
      stringr::str_extract('[a-zA-Z0-9]+\\.[a-zA-Z0-9]+$') %>% #ensure filename.extension form
      stringr::str_extract('[a-zA-Z0-9]+$')                  #extract extension
  }
#+end_src
*** Mark the text column of a table
A helper function to determine and mark the text column of a table
#+begin_src R :session rsession1 :tangle ~/inzightta/R/utils.R :eval never-export :exports both
  #' Interactively determine and automatically mark the text column of a table
  #'
  #' @param data dataframe with column requiring marking
  #'
  #' @return same dataframe with text column renamed to "text"
  table_textcol <- function(data){
  cols <- colnames(data)
  print("Please enter the number of the column you want selected for text analytics")
  print(cols)
  textcol_index <- get_valid_input(as.character(1:ncol(data))) %>%
    as.integer 
  textcol <- cols[textcol_index]  
  data %>%
      dplyr::rename(text = !! dplyr::sym(textcol))
  }
#+end_src
*** Validate User Input
A helper function to get valid user input
#+begin_src R :session rsession1 :tangle ~/inzightta/R/utils.R :eval never-export :exports both
  #' helper function to get valid input (recursively)
  #'
  #' @param options vector of options that valid input should be drawn from
  #'
  #' @param init whether this is the initial attempt, used only as
  #'   recursive information
  #'
  #' @return readline output that exists in the vector of options
  get_valid_input <- function(options, init=TRUE){
    input <- ifelse(init,
		    readline(),
		    readline(prompt = "Invalid option. Please try again: "))
    ifelse(input %in% options,
	   input,
	   get_valid_input(options, init=FALSE))
  }
#+end_src
*** TODO [#C] Ungroup by
Also needed, but surprisingly missing from dplyr, is an "ungroup_by"
function, that allows specifice groups to be removed. Currently
standard evaluation only, will switch to NSE when time allows

TODO:
- [ ] Make =ungroup_by= NSE
#+begin_src R :session rsession1 :tangle ~/inzightta/R/utils.R :eval never-export :exports both
  #' helper function to ungroup for dplyr. functions equivalently to
  #' group_by() but with standard (string) evaluation
  #'
  #' @param x tibble to perform function on
  #'
  #' @param ... string of groups to ungroup on
  #'
  #' @return x with ... no longer grouped upon
  ungroup_by <- function(x,...){
  dplyr::group_by_at(x, dplyr::group_vars(x)[!dplyr::group_vars(x) %in% ...])
  }
#+end_src
* Program Layer: Preparation
Here I lay out the preparation layer in detail. The culmination of all
preparation functions is one wrapper, requesting the possible
preparation features, and outputting a final tibble that is worked on
by the next insight layer.

Multiple documents are input the same as singular, though with an
additional "document" column that can be grouped upon.

The following sections detail the components of text preparation.
** TODO [#C] Importing
A variety of filetypes are able to be imported, with one wrapper
function intelligently determining the appropriate import function
from the file extension. Files with unrecognised extensions are
treated as plaintext. Importantly, as we are working in a tidy
paradigm, everything is imported as a tibble, with plaintext being one
line per row, and tabular data maintaining the original form. Tabular
data requires the specification of which column is the text column for
analytics. All imports have a document ID, which is an identifier column.
*** Import .txt
Plaintext is the most important and simplest to work with of all text
representations; entire operating systems are built around the
concept. 
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-import.R :eval never-export :exports both
  #' Import text file 
  #'
  #' @param filepath a string indicating the relative or absolute
  #'     filepath of the file to import
  #' 
  #' @return a [tibble][tibble::tibble-package] of each row
  #'   corrresponding to a line of the text file, with the column named
  #'   "text"
  import_txt <- function(filepath){
    readr::read_lines(filepath) %>%
      tibble::tibble(text=.)
  }
#+end_src
*** Import .csv
CSV is a plaintext tabular format, with columns typically delimited by
commas, and rows by new lines. A particular point of difference in the
importation of tabular data and regular plaintext is that the text of
interest for the analysis should be (as per tidy principles) in one
column, with the rest being additional information that can be used
for grouping or filtering. Thus, additional user input is required, in
the specification of which column is the text column of interest.
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-import.R :eval never-export :exports both
  #' Import csv file
  #'
  #' @param filepath a string indicating the relative or absolute
  #'     filepath of the file to import
  #'
  #' @return a [tibble][tibble::tibble-package] of each row
  #'   corrresponding to a line of the text file, with the column named
  #'   "text"
  import_csv <- function(filepath){
    readr::read_csv(filepath) ## %>%
      ## table_textcol()
  }
#+end_src
*** Import Excel
Unfortunately, much data exists in the Microsoft Excel format, but
this must be catered for. As tabular data, it is treated equivalently
to csv.
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-import.R :eval never-export :exports both
  #' Import excel file
  #'
  #' @param filepath a string indicating the relative or absolute
  #'     filepath of the file to import
  #'
  #' @return a [tibble][tibble::tibble-package] of each row
  #'     corrresponding to a line of the text file, with the column
  #'     named "text"
  import_excel <- function(filepath){
    readxl::read_excel(filepath) ## %>%
      ## table_textcol()
  }
#+end_src
*** TODO Import Gutenberg
Project Gutenberg is an online library containing, at the time of
writing, over 57,000 items, primarily plaintext ebooks. This is a
goldmine of text ripe for analysis, and once the basic frontend is
complete, I will dedicate some thought to the in-app importation of
Gutenberg texts
