doc/journal.org
*** Import
The base wrapper function takes in the filename, and other relevent
information, handling the importation process. It also stamps in the
name of the document as a column
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-import.R :eval never-export :exports both
  #' Base case for file import
  #'
  #' @param filepath string filepath of file for import
  #'
  #' @return imported file with document id
  import_base_file <- function(filepath){
    filetype <- get_filetype(filepath)
    filename <- basename(filepath)
    if (filetype == "csv"){
      imported <- import_csv(filepath)
    } else if (filetype == "xlsx" | filetype == "xls") {
      imported <- import_excel(filepath)
    } else {
      imported <- import_txt(filepath)
    }
    imported %>%
      dplyr::mutate(doc_id = filename)
  }
#+end_src
The base file import is generalised to multiple files with a multiple
import function: this will be our sole import function (until we get
direct Gutenburg import)
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-import.R :eval never-export :exports both
  #' Import any number of files
  #'
  #' @param filepaths char vector of filepaths
  #'
  #' @return a [tibble][tibble::tibble-package] imported files with
  #'   document id
  #' 
  #' @export
  import_files <- function(filepaths){
    filepaths %>%
      purrr::map(import_base_file) %>%
      dplyr::bind_rows()
  }
#+end_src
** Formatting
To work in a tidy paradigm, following the lead of tidytext, we
separate and ID by token. To do this, we take the line ID, the
sentence ID, then the word ID, producing a dataframe that takes the
following form:

| line_id | sentence_id | word_id | word  |
|---------+-------------+---------+-------|
|       1 |           1 |       1 | the   |
|       1 |           1 |       2 | quick |
|       2 |           1 |       3 | brown |

The reason for the ID columns is the preservation of the structure of
the text; If required, the original text can be reconstructed in
entirety, sans minor punctuation differences. The =unnest_tokens=
function from tidytext doesn't play as expected with groups at
present, so much of grouping is (not ideally) taking place internally
in the first =group_modify=. When I have the luxury of time, I will
try to optimise this.

[2019-07-17 Wed]: removed first group modify; unnecessary now that
grouping has been shifted to take place afterwards

#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-format.R :eval never-export :exports both
  #' formats imported data into an analysis-ready format '
  #' @param data a tibble formatted with a text and (optional) group
  #'     column
  #'
  #' @return a [tibble][tibble::tibble-package] formatted such that
  #'     columns correspond to identifiers of group, line, sentence,
  #'     word (groups ignored)
  #'
  #' @export
  format_data <- function(data){
    data %>%
      dplyr::mutate(line_id = dplyr::row_number()) %>% 
        tidytext::unnest_tokens(output = sentence, input = text,
                                token = "sentences", to_lower = FALSE) %>%
      dplyr::mutate(sentence_id = dplyr::row_number()) %>%
      dplyr::group_by(sentence_id, add=TRUE) %>%
      dplyr::group_modify(~ {
	.x %>%
            tidytext::unnest_tokens(output = word, input = sentence,
                                    token = "words", to_lower=FALSE) %>%
	  dplyr::mutate(word_id = dplyr::row_number())
      }) %>%
      ungroup_by("sentence_id")
  }
#+end_src
** TODO Filtering
Filtering has to be done with code at present, but the intention is
that once I have a frontend up, it's design will inform an interactive
filter. After some initial analytics have been done in the insight
layer, then preparation can be returned to and the text can be
filtered on based on the analytics.
** TODO Lemmatisation
Lemmatisation is effectively the process of getting words into
dictionary form. It is actually a very complex, stochastic procedure,
as natural languages don't follow consistent and clear rules all the
time. Hence, models have to be used. Despite the burden, it is
generally worthwhile to lemmatise words for analytics, as there are
many cases of words not being considered significant, purely due to
taking so many different forms relative to others. Additionally,
stopwords work better when considering just the lemmatised form,
rather than attempting to exhaustively cover every possible form of a
word. [[https://github.com/trinker/textstem/][textstem]] is an R package allowing for easy lemmatisation, with
it's function =lemmatize_words= transforming a vector of words into
their lemmatised forms (thus being compatible with =mutate= straight
out of the box). Udpipe was another option, but it requires
downloading model files, and performs far more in depth linguistic
determinations such as parts-of-speech tagging, that we don't need at
this point. Worth noting is that, like stopwords, there are different
dictionaries available for the lemmatisation process, but we will use
the default, as testing has shown it to be the simplest to set up and
just as reliable as the rest.
** TODO Stemming
Stemming is far simpler than lemmatisation, being the removal of word
endings. This doesn't require as complex a model, as it is
deterministic. It is not quite as effective, as the base word ending
is not tacked back on at the end, so we are left with word stumps and
morphemes. However, it may sometimes be useful when the lemmatisation
model isn't working effectively, and textstem provides the capability
with =stem_words=
** Stopwords
Stopwords are syntactical features of text that are superfluous and
get in the way of text analytics. Typical examples include articles
and pronouns, like "the", "to", "I", etc. They would clutter the
output of insights such as word frequency. We need a way of generating
a list of stopwords, from both a default source, as well as allowing
the user to add their own stopwords. =get_sw= performs that, detailed
below.
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-format.R :eval never-export :exports both
  #' Gets stopwords from a default list and user-provided list
  #'
  #' @param lexicon a string name of a stopword list, one of "smart",
  #'     "snowball", or "onix"
  #'
  #' @param addl user defined character vector of additional stopwords,
  #'     each element being a stopword
  #'
  #' @return a [tibble][tibble::tibble-package] with one column named "word"
  get_sw <- function(lexicon = "snowball", addl = NA){
    addl_char <- as.character(addl)
    tidytext::get_stopwords(source = lexicon) %>%
      dplyr::select(word) %>%
      dplyr::bind_rows(., tibble::tibble(word = addl_char)) %>%
      stats::na.omit() %>%
      purrr::as_vector() %>%
      tolower() %>%
      as.character()
  }
#+end_src
The status of the stopwords are then added to the data with =determine_stopwords=
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-format.R :eval never-export :exports both
  #' determine stopword status
  #'
  #' @param .data vector of words
  #'
  #' @param ... arguments of get_sw
  #'
  #' @return a [tibble][tibble::tibble-package] equivalent to the input
  #'   dataframe, with an additional stopword column
  #'
  #' @export
  determine_stopwords <- function(.data, ...){
    sw_list <- get_sw(...)
    .data %in% sw_list
  }
#+end_src
