doc/journal.org
** Object Preparation
The =preparation= wrapper takes all combinations of stopwords and
lemmatisation options and intelligently connects them for the "insight
column", which the insight is performed upon. For the purpose of
standard interoperability with, e.g., ggpage, we name this column
"text"

The gnarly =ifexp= taking up the heart of the function encodes the
logic involving the interaction of stopwords and lemmatisation:

|                 | Stopwords True                                                                                    | Stopwords False                      |
| Lemmatise True  | Lemmatise, determine stopwords on lemmatisation, perform insight on lemmas sans stopwords         | Lemmatise, perform insight on lemmas |
| Lemmatise False | Determine stopwords on original words (no lemmatisation), perform insight on words sans stopwords | Perform insight on original words    |

#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-format.R :eval never-export :exports both
  #' takes imported one-line-per-row data and prepares it for later analysis
  #'
  #' @param .data tibble with one line of text per row
  #'
  #' @param lemmatize boolean, whether to lemmatize or not
  #'
  #' @param stopwords boolean, whether to remove stopwords or not
  #'
  #' @param sw_lexicon string, lexicon with which to remove stopwords
  #'
  #' @param addl_stopwords char vector of user-supplied stopwords
  #'
  #' @return a [tibble][tibble::tibble-package] with one token per line,
  #'   stopwords removed leaving NA values, column for analysis named
  #'   "text"
  #'
  #' @export
  text_prep <- function(.data, lemmatize=TRUE, stopwords=TRUE,
                        sw_lexicon="snowball", addl_stopwords=NA){
    formatted <- .data %>%
      format_data()

    text <- ifexp(lemmatize,
		  ifexp(stopwords,
			dplyr::mutate(formatted,
                                      lemma = tolower(textstem::lemmatize_words(word)),
				      stopword = determine_stopwords(lemma,
                                                                     sw_lexicon,
                                                                     addl_stopwords),
				      text = dplyr::if_else(stopword,
						     as.character(NA),
						     lemma)),
			dplyr::mutate(formatted,
                                      lemma = tolower(textstem::lemmatize_words(word)),
				      text = lemma)),
		  ifexp(stopwords,
			dplyr::mutate(formatted,
                                      stopword = determine_stopwords(word,
                                                                     sw_lexicon,
                                                                     addl_stopwords),
				      text = dplyr::if_else(stopword,
						     as.character(NA),
						     word)),
			dplyr::mutate(formatted, text = word)))
    return(text)
  }
#+end_src
** Sectioning
Plaintext, as might exist as a Gutenberg Download, differs from more
complex representations in many ways, including a lack of sectioning -
Chapters require a specific search in order to jump to them. Here, I
compose a closure that searches and sections text based on a Regular
Expression intended to capture a particular section. Several functions
are created from that. In time, advanced users could be given the
option to compose their own regular expressions for sectioning.
#+begin_src R :session rsession1 :tangle ~/inzightta/R/preparation-format.R :eval never-export :exports both
  #' creates a search closure to section text
  #'
  #' @param search a string regexp for the term to seperate on, e.g. "Chapter"
  #'
  #' @return closure over search expression 
  get_search <- function(search){
    function(.data){
      .data %>%
	stringr::str_detect(search) %>%
	purrr::accumulate(sum, na.rm=TRUE)
      }
  }

  #' sections text based on chapters
  #'
  #' @param .data vector to section
  #'
  #' @return vector of same length as .data with chapter numbers
  #'
  #' @export
  get_chapters <- get_search("^[\\s]*[Cc][Hh][Aa]?[Pp][Tt]([Ee][Rr])?")

  #' sections text based on parts
  #'
  #' @param .data vector to section
  #'
  #' @return vector of same length as .data with part numbers
  #'
  #' @export
  get_parts <- get_search("^[\\s]*[Pp]([Aa][Rr])?[Tt]")

  #' sections text based on sections
  #'
  #' @param .data vector to section
  #'
  #' @return vector of same length as .data with section numbers
  #'
  #' @export
  get_sections <- get_search("^[\\s]*([Ss][Ss])|([Ss][Ee][Cc][Tt][Ii][Oo][Nn])")

  #' Adds section column to dataframe
  #'
  #' @param .data dataframe formatted as per output of prep process
  #'
  #' @param section_by character name of what to section over
  #'
  #' @return input dataframe with additional section column
  #'
  #' @export
  section <- function(.data, section_by){
      sec_table <- list("chapter" = get_chapters,
                        "part" = get_parts,
                        "section" = get_sections)
      .data %>%
          dplyr::mutate(!! section_by := sec_table[[section_by]](word))
  }
#+end_src

How to implement sectioning in a way that fits in a shiny UI is still
very much TBC. Presumably, after object preparation, the option to
section would appear, followed by a group selection option. I will
implement these only after implementing the shiny app.
** TODO Grouping 
Grouping is a killer feature of our app. The intention is to run a
=group_by= dplyr command in the wrapper over user-specified groups,
and all further insights and visualisations are performed groupwise.
This allows for immediate and clear comparisons.

Like filtering, after some initial analytics have been done in the
insight layer, then preparation can be returned to and the text can be
grouped on based on the analytics.
* Program Layer: Insight
Insight is the meat of this package. After some initial resistance, I
have decided to jump all-in with tidyverse-style transformations,
especially for the non-destructive editing, as an immutable functional
programming paradigm suits such functions. Insight may be divided into
word insight, and higher-level (aggregated) insights. The higher level
insights include sentence and document level insights, such as
sentence sentiment, tf-idf, etc. Importantly for the document level
insights is that our program doesn't necessarily have to work purely
on documents - any identifying column could potentially stand in.

At present, all insight functions haven't yet been tested with the new
output of the Preparation layer. I want to make the following changes
to all of them for this to be effective:

TODO:
- [X] Have all insight functions work on vector input and output, so
  as to work with =mutate=
- [X] Ensure correctness of output under grouping
** Term Insight
*** Term Frequency
Frequencies of words are useful in getting an understanding of what
terms are common in a text. This is one insight in particular that
requires stopwords to have been previously removed, otherwise the top
words will always be syntactical glue, such as articles
#+begin_src R :session rsession1 :tangle ~/inzightta/R/insight-term.R :eval never-export :exports both
  #' Determine term frequency
  #'
  #' @param .data character vector of terms
  #'
  #' @return numeric vector of term frequencies
  #'
  #' @export
  term_freq <- function(.data){
    .data %>%
      tibble::enframe() %>%
    dplyr::add_count(value) %>%
    dplyr::mutate(n = dplyr::if_else(is.na(value),
		       as.integer(NA),
		       n))  %>%
    dplyr::pull(n)
  }
#+end_src
