doc/journal.tex
\subsubsection{Bigrams [0/1]}
\label{sec:orgb27c210}
Bigrams are two words that occur in sequence. For example, in the
phrase, "The quick brown dog.", the following bigrams exist: "The
quick", "quick brown", "brown dog". This can be generalised to any
number of sequential words as \emph{n-grams}. They are useful in text
analytics to determine word sequences, as well as common adverb-verb
and adjective-noun pairs. This exists partly between word and
aggregate insight, but by measure is closer to the word-level.

When we attain the bigrams, we can use the word frequency function
defined previously to attain a bigram frequency.

TODO:
\begin{itemize}
\item[{$\square$}] generalise to n-grams (make closure, have bigrams as special
case)
\end{itemize}

I determine bigrams by matching the vector of words with itself, sans
the first element in the second list.
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
#' Determine bigrams
#'
#' @param .data character vector of words
#'
#' @return character vector of bigrams
#'
#' @export
get_bigram <- function(.data){
  1:length(.data) %>%
    purrr::map_chr(index_bigram, .data, .data[-1])
}
\end{minted}

However, it is more complex than that; we need a way to deal with NA
values. This beautiful recursive function (designed by myself) does
just that:

\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
#' get bigram at index i of list1 & 2
#'
#' @param i numeric index to attain bigram at
#'
#' @param list1 list or vector for first bigram token
#'
#' @param list2 list or vector for second bigram token
#'
#' @return bigram of list1 and list2 at index i, skipping NA's
index_bigram <- function(i, list1, list2){
  ifelse(length(list2) < i | is.na(list1[i]),
	  as.character(NA),
  ifelse(!(is.na(list1[i]) | is.na(list2[i])),
	 paste(list1[i], list2[i]),
	 index_bigram(i,list1, list2[-1])))
}
\end{minted}

It works as follows; if our list appears as (1 2 X 4 5 X 7 X), we
expect the following bigrams: ((1 2) (2 4) X (4 5) (5 7) X X X), due
to bigrams taking the lead of list1 as list2, as per the following
table:

\begin{center}
\begin{tabular}{rrl}
list1 & list2 & bigram\\
\hline
 & 1 & \\
1 & 2 & 1 2\\
2 & X & 2 4\\
X & 4 & X\\
4 & 5 & 4 5\\
5 & X & 5 7\\
X & 7 & X\\
7 & X & X\\
X &  & X\\
\end{tabular}
\end{center}

\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
x <- c(1, 2, NA, 4, 5, NA, 7, NA)
get_bigram(x)
\end{minted}

\begin{center}
\begin{tabular}{l}
1 2\\
2 4\\
nil\\
4 5\\
5 7\\
nil\\
nil\\
nil\\
\end{tabular}
\end{center}

\subsubsection{Key Words (TextRank)}
\label{sec:org19fcd72}
Key words are another killer feature of this app. The algorithm is
explained previously. The \texttt{textrank} package is used to perform
textrank. Of note is that all words other than stopwords (indicated by
NA) are relevent, but the standard algorithm works on data that has
had POS tagging, typically assessing only nouns and adjectives. We
don't do that here as the processing burden for POS tagging is
enormous, though it may be implemented in the future.
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
#' Determine textrank score for vector of words
#'
#' @param .data character vector of words
#'
#' @return vector of scores for each word
#'
#' @export
keywords_tr <- function(.data){
  relevent <- !is.na(.data)
  tr <- textrank::textrank_keywords(.data, relevent, p=+Inf)
  score <- tr$pagerank$vector %>% tibble::enframe()
  data <- .data %>% tibble::enframe("number", "name")
  dplyr::full_join(data, score, by="name") %>%
    dplyr::pull(value)
}
\end{minted}

\subsubsection{Term Sentiment [1/1]}
\label{sec:org3be893a}
Sentiment has been discussed earlier. Effectively, for any text
analytics it is essential. There are numerous sentiment dictionaries,
but we will use AFINN for the nice numeric properties it has, allowing
for statistics on them. Categorical dictionaries will be implemented
later.

I \textbf{really} want to move away from dependence on tidytext; the
maintainers are clearly incompetent. As an example, the \texttt{sentiments}
data provided by the package previously contained several different
lexicons, and had a column indicating the lexicon. After an update,
this column was removed, leaving only the bing lexicon, breaking my
functions, with no indication of where the other lexicons were in the
documentation. The inconsistincies don't stop there; \texttt{sentiments} has
two columns, word, and sentiment, whereas \texttt{get\_sentiments} is
\begin{quote}
A tbl\textsubscript{df} with a word column, and either a ‘sentiment’ column (if
‘lexicon’ is not "afinn") or a numeric ‘score’ column (if
‘lexicon’ is "afinn").
\end{quote}
So bing has sentiment if \texttt{sentiment} is invoked, but score if
\texttt{get\_sentiment} is invoked. All the while I have to completely
unnecessarily program different selection names based on the different
lexicons, instead of being able to rely on a simple static name. If I
want different names, that should be my decision, not the packages'.
The greatest irony is that in practice, as at \textit{[2019-07-20 Sat] } on
CRAN, the documentation isn't even correct; \texttt{get\_sentiment} returns
columns "word" and "value"

\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
get_sentiments("afinn")
\end{minted}

\begin{verbatim}
get_sentiments("afinn")
# A tibble: 2,477 x 2
   word       value
   <chr>      <dbl>
\end{verbatim}


 Additionally, the \texttt{reorder\_within} function is very
poorly coupled with the rest of the package. It should have been a
pull request to forcats, or an alternative, but it is far more general
than the scope of the \texttt{tidytext} package. Moreover, the style of the
package is very inconsistent and generally awful. Literally the only
purpose it has served has been getting me up to speed through it's
associated ebook, but even then if that book didn't exist, someone
else (maybe me) would have written a better one with a better package.
The ebook itself encourages very poor data practices, mandating lossy
forms of working, and it has taken me half a year to work through the
issues encouraged by them. I can see the lack of seriousness in the
development where recent commit messages include "Do not check these
in either see\textsubscript{no}\textsubscript{evil}" with a monkey face emoji. 

Without any options, they also forced the requirement to
(interactively) download sentiment files (through the textdata
package) instead of including them in the package. \textbf{These changes
break backwards compatibility}. I have no idea how they will affect my
shiny application. Likely, I'll just get the data myself and
distribute that with my package, if I don't want specific licenses, I
just won't include them.

TODO:
\begin{itemize}
\item[{$\boxtimes$}] Include option for additional dictionaries
\end{itemize}
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
#' Determine sentiment of words
#'
#' @param .data vector of words
#'
#' @param lexicon sentiment lexicon to use, based on the corpus
#'   provided by tidytext
#' 
#' @return vector with sentiment score of each word in the vector
#'
#' @export
term_sentiment <- function(.data, lexicon="afinn"){
  data <- tibble::enframe(.data, "number", "word")
  tidytext::get_sentiments(lexicon) %>%
    dplyr::select(word, value) %>%
    dplyr::right_join(data, by="word") %>%
    dplyr::pull(value)
}
\end{minted}
