doc/journal.tex
\subsubsection{{\bfseries\sffamily TODO} Word Correlation}
\label{sec:org139dcb7}
This is the word-level insight that will be the most difficult to
perform, due to my requirements that the dataframe remains tidy and
lossless. The only way I can conceive of doing this is by adding
columns for each distinct word, giving correlations there. The best
form of visualisation would be individual words with their scores, a
correlation matrix for some words, or a table and search like the one
Cassidy created.
\subsection{{\bfseries\sffamily TODO} Aggregate Insight}
\label{sec:org2809dfb}
This should work effectively the same as the word-level insight,
however the wrapper may have to be different. This is TBC. I think an
"aggregate on \ldots{}" user option would be useful
\subsubsection{Term Count}
\label{sec:org4b840f5}
Word count on some aggregate group is following the pattern I have
been noticing where the simpler a function is, the more analytical
power it seems to give. This may be generalised in the future to give
a nested aggregate count (e.g. sentences/paragraph, lines/document
etc.)

Note in the following function the near canonical example of
split-apply-combine, or MapReduce style. This allows for performance
gains in parallel processing, ideal for the large datasets we
typically work with in text analytics.
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
#' Determine the number of terms at each aggregate level
#'
#' @param .data character vector of terms
#'
#' @param aggregate_on vector to split .data on for insight
#'
#' @return vector of number of terms for each aggregate level, same
#'   length as .data
#'
#' @export
term_count <- function(.data, aggregate_on){
  split(.data, aggregate_on) %>%
    purrr::map(function(x){rep(length(x), length(x))}) %>%
    dplyr::combine()
}
\end{minted}
\subsubsection{Key Sentence (LexRank)}
\label{sec:org71dc6af}
Often keywords aren't very explanatory on their own; patterns only
really develop in aggregate. We use lexrank as the algorithm for
key-sentences, as textrank takes too long, though lexrank seems to
take just as long at high \emph{n} - it may be worth exploring the option
of textrank again.

Testing shows a performance of around 3-4 mins for \textasciitilde{}30,000 words of
text aggregated of \textasciitilde{}3000 sentences. Not bad for something graph based,
but a warning will be required at the user end.
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
#' get score for key sentences as per Lexrank
#'
#' @param .data character vector of words
#'
#' @param aggregate_on vector to aggregate .data over; ideally, sentence_id
#'
#' @return lexrank scores of aggregates
#'
#' @export
key_aggregates <- function(.data, aggregate_on){
  ## prepare .data for lexrank
  base <-  tibble::tibble(word = !! .data, aggregate = aggregate_on)
  aggregated <- base %>%
    dplyr::group_by(aggregate) %>%
    stats::na.omit() %>%
    dplyr::summarise(sentence = paste(word, collapse = " ")) %>%
    dplyr::mutate(sentence = paste0(sentence, "."))
  ## lexrank
  lr <- aggregated %>%
    dplyr::pull(sentence) %>%
    lexRankr::lexRank(., n=length(.),removePunc = FALSE, returnTies = FALSE,
	    removeNum = FALSE, toLower = FALSE, stemWords = FALSE,
	    rmStopWords = FALSE, Verbose = TRUE)
  ## match lexrank output to .data
  lr %>%
    dplyr::distinct(sentence, .keep_all = TRUE) %>% 
    dplyr::full_join(aggregated, by="sentence") %>%
    dplyr::full_join(base, by="aggregate") %>%
    dplyr::arrange(aggregate) %>%
    dplyr::pull(value)
}
\end{minted}
\subsubsection{Aggregate Sentiment}
\label{sec:org51605f9}
Like the added context that key sentences bring over key words, a
similar situation is true of sentiment. I'll make it so that it can
deliver any statistic of a sentence; mean, median, variance etc.
Importantly, it will only work with numeric sentiment lexicons, in our
case, AFINN.
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
#' Get statistics for sentiment over some group, such as sentence.
#'
#' @param .data character vector of words
#'
#' @param aggregate_on vector to aggregate .data over; ideally,
#'   sentence_id, but could be chapter, document, etc.
#'
#' @param statistic function that accepts na.rm argument; e.g. mean,
#'   median, sd.
#'
#' @export
aggregate_sentiment <- function(.data, aggregate_on, statistic = mean){
  tibble::enframe(.data, "nil1", "word") %>%
    dplyr::bind_cols(tibble::enframe(aggregate_on, "nil2", "aggregate")) %>%
    dplyr::select(word, aggregate) %>%
    dplyr::mutate(sentiment = term_sentiment(word)) %>%
    dplyr::group_by(aggregate) %>%
    dplyr::mutate(aggregate_sentiment =
		    (function(.x){
		      rep(statistic(.x, na.rm = TRUE), length(.x))
		    })(sentiment)) %>%
    dplyr::pull(aggregate_sentiment)
}
\end{minted}
\subsubsection{{\bfseries\sffamily TODO} Term Frequency - Inverse Document Frequency (tf-idf)}
\label{sec:org351a4dd}
