doc/journal.org
*** CLOSED [#A] ggpage
    CLOSED: [2019-09-02 Mon 17:34]
 ggpage allows us to show off the importance of our non-destructive
 editing - the original document can be displayed, with the insights
 highlighted. There was more discussion on ggpage under an earlier section.

#+begin_src R :session rsession1 :tangle ~/inzightta/R/visualisation.R :eval never-export :exports both
  #' Colours a ggpage based on an insight function
  #'
  #' @param .data a dataframe containing "word" and insight columns as
  #'     per the output of the get_(term|aggregate)_insight wrapper
  #'     function
  #'
  #' @param col_name symbol name of the insight column intended to
  #'     colour plot
  #'
  #' @return ggplot object as per ggpage
  #'
  #' @export
  struct_ggpage_ungrouped <- function(.data, col_name){
      q_col_name <- dplyr::enquo(col_name)
      .data %>%
          dplyr::pull(word) %>%
          ggpage::ggpage_build() %>%
          dplyr::bind_cols(.data) %>% 
          ggpage::ggpage_plot(ggplot2::aes(fill = !! q_col_name)) ## +
          ## ggplot2::labs(title = "")
  }
#+end_src
** Wrapper
This is an attempt to create a group-aware visualisation,
automatically facetting by group. I feel like it is not ideal, though
haven't had any major bugs with it yet
#+begin_src R :session rsession1 :tangle ~/inzightta/R/visualisation.R :eval never-export :exports both
#' create a group-aware visualisation
#'
#' @param .data the standard dataframe, modified so the last column
#'     is the output of some insight function (eg. output from
#'     term_freq)
#'
#' @param vis character name of visualisation function
#'
#' @param col character name of the column to get insight from
#'
#' @param facet_by character name of the column to facet by
#'
#' @param scale_fixed force scales to be fixed in a facet
#'
#' @export
get_vis <- function(.data, vis, col, facet_by="", scale_fixed = TRUE){
    vistable <- list("struct_ggpage_ungrouped" = struct_ggpage_ungrouped,
                     "struct_ts_ungrouped" = struct_ts_ungrouped,
                     "score_bar_ungrouped" = score_bar_ungrouped,
                     "dist_density_ungrouped" = dist_density_ungrouped,
                     "dist_hist_ungrouped" = dist_hist_ungrouped)
    col_name <- dplyr::sym(col)
    chart <- vistable[[vis]](.data, !! col_name)
    if (shiny::isTruthy(facet_by)){
        facet_name <- dplyr::sym(facet_by)
        q_facet_name <- dplyr::enquo(facet_name)
        return(chart + ggplot2::facet_wrap(ggplot2::vars(!! q_facet_name),
                                           scales = ifelse(vis == "struct_ggpage_ungrouped" | scale_fixed,
                                                           "fixed",
                                                           "free")))

    } else {
        return(chart)
    }
}
#+end_src
* Testing / Demonstration
** Source
 #+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both :output nil
   library(inzightta)
 #+end_src

** Ungrouped
*** Preparation
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
  imported <- import_files(tcltk::tk_choose.files())
  lemmatize <- TRUE
  stopwords <- TRUE
  sw_lexicon <- "snowball"
  addl_stopwords <- NA
  data <- text_prep(imported, lemmatize, stopwords, sw_lexicon, addl_stopwords)
#+end_src

#+RESULTS:

*** Insights
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
  insighted <- data %>%
    dplyr::mutate(
    term_freq = term_freq(text),
    bigram = get_bigram(text),
    bigram_freq = term_freq(bigram),
    word_sentiment = term_sentiment(text),
    term_count_sentence = term_count(text, sentence_id),
    mean_aggregate_sentiment_sentence = aggregate_sentiment(text, sentence_id, mean),
    sd_aggregate_sentiment_sentence = aggregate_sentiment(text, sentence_id, sd)
    )
#+end_src

#+RESULTS:

*** Visualisation
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
  # … with 29,944 more rows, and 13 more variables: line_id <int>, word1 <chr>,
  #   word_id <int>, lemma <chr>, stopword <lgl>, text <chr>, term_freq <int>,
  #   bigram <chr>, bigram_freq <int>, word_sentiment <int>,
  #   term_count_sentence <int>, mean_aggregate_sentiment_sentence <dbl>,
  #   sd_aggregate_sentiment_sentence <dbl>

  ## Structure: ggpage --------------------------------

  insighted %>%
    dplyr::pull(word) %>%
    ggpage::ggpage_build() %>%
    dplyr::bind_cols(insighted) %>%
    ggpage::ggpage_plot(ggplot2::aes(colour=mean_aggregate_sentiment_sentence)) +
    ggplot2::scale_color_gradient2()

  insighted %>%
    dplyr::pull(word) %>%
    ggpage::ggpage_build() %>%
    dplyr::bind_cols(insighted) %>%
    ggpage::ggpage_plot(ggplot2::aes(colour=term_count_sentence)) +
    ggplot2::labs(title = "Word Count of Sentences")

  ## Distribution: Histogram --------------------------------

  insighted %>%
    ggplot2::ggplot(ggplot2::aes(term_freq)) +
    ggplot2::geom_histogram() +
    ggplot2::labs(title = "Histogram of Word Frequency")

  ## Score: barplot --------------------------------

  n <- 10

  insighted %>%
    dplyr::distinct(bigram, .keep_all = TRUE) %>%
    dplyr::top_n(n, bigram_freq) %>%
    dplyr::mutate(bigram = forcats::fct_reorder(bigram, dplyr::desc(bigram_freq))) %>%
    ggplot2::ggplot(ggplot2::aes(bigram, bigram_freq)) +
      ggplot2::geom_col() +
      ggplot2::coord_flip() +
    ggplot2::labs(title = "Bigrams by Bigram Frequency")
#+end_src
** Grouped
*** Preparation
We import a file downloaded from Project Gutenberg, and run through
some basic preparation, with additional stopwords to be removed
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
  imported <- import_files(tcltk::tk_choose.files())
  lemmatize <- TRUE
  stopwords <- TRUE
  sw_lexicon <- "snowball"
  addl_stopwords <- NA
  prepped <- text_prep(imported, lemmatize, stopwords, sw_lexicon, addl_stopwords)
  sectioned <- prepped %>% dplyr::mutate(chapter = get_chapters(text))
  data <- sectioned %>%
    dplyr::group_by(doc_id, chapter)

  ## .data <- data$text
  ## aggregate_by <- data$chapter
#+end_src

#+RESULTS:

*** Insights
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
  insighted <- data %>%
    dplyr::mutate(
    term_freq = term_freq(text),
    bigram = get_bigram(text),
    bigram_freq = term_freq(bigram),
    word_sentiment = word_sentiment(text),
    term_count_sentence = term_count(text, sentence_id),
    mean_aggregate_sentiment_sentence = aggregate_sentiment(text, sentence_id, mean),
    sd_aggregate_sentiment_sentence = aggregate_sentiment(text, sentence_id, sd)
    )

  ## alt_insighted <- data %>%
  ##   group_modify(~ {
  ##     .x %>%
  ##   dplyr::mutate(
  ##   term_freq = term_freq(text),
  ##   bigram = get_bigram(text),
  ##   bigram_freq = term_freq(bigram),
  ##   word_sentiment = word_sentiment(text),
  ##   term_count_sentence = term_count(text, sentence_id),
  ##   mean_aggregate_sentiment_sentence = aggregate_sentiment(text, sentence_id, mean),
  ##   sd_aggregate_sentiment_sentence = aggregate_sentiment(text, sentence_id, sd)
  ##   )      
  ##   })

  ## testthat::test_that("groups work with dplyr::mutate as with group_modify",
  ## {
  ##   expect_equal(insighted, alt_insighted)
  ## })
#+end_src

#+RESULTS:

