doc/journal.org
*** Visualisation
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
  ## Structure: ggpage --------------------------------
  groups <- dplyr::group_vars(insighted)

  insighted %>% #base data
    dplyr::group_modify(~ { #build ggpage
      .x %>%
	dplyr::pull(word) %>%
	ggpage::ggpage_build() %>%
	dplyr::bind_cols(.x)  
    }) %>%
    ggpage::ggpage_plot(ggplot2::aes(colour=mean_aggregate_sentiment_sentence)) + #plot ggpage
    ggplot2::scale_color_gradient2() +
    ggplot2::facet_wrap(groups) +
    ggplot2::labs(title = glue::glue("Mean Sentiment of Sentences by {paste(groups, collapse = \", \")}"))

  ggplot2::ggsave(filename = "mean-sent-ggpage.png", device = "png", path="~/stats-781/out/")

  insighted %>% #base data
    dplyr::group_modify(~ { #build ggpage
      .x %>%
	dplyr::pull(word) %>%
	ggpage::ggpage_build() %>%
	dplyr::bind_cols(.x)  
    }) %>%
    ggpage::ggpage_plot(ggplot2::aes(colour=sd_aggregate_sentiment_sentence)) + #plot ggpage
    ggplot2::scale_color_gradient2() +
    ggplot2::facet_wrap(groups) +
      ggplot2::labs(title = glue::glue("Sentiment Standard Deviation of Sentences by {paste(groups, collapse = \", \")}"))

  
  ggsave(filename = "sd-sent-ggpage.png", device = "png", path="~/stats-781/out/")


  insighted %>% #base data
     dplyr::group_modify(~ { #build ggpage
      .x %>%
	dplyr::pull(word) %>%
	ggpage::ggpage_build() %>%
	dplyr::bind_cols(.x)  
    }) %>%
    ggpage::ggpage_plot(ggplot2::aes(colour=term_count_sentence)) + #plot ggpage
    ## scale_color_gradient2() +
    ggplot2::facet_wrap(groups) +
    ggplot2::labs(title = glue::glue("Word Count of Sentences by {paste(groups, collapse = \", \")}"))

  insighted %>%
    dplyr::pull(word) %>%
    ggpage::ggpage_build() %>%
    dplyr::bind_cols(insighted) %>%
    ggpage::ggpage_plot(ggplot2::aes(colour=term_count_sentence)) +
    ggplot2::labs(title = "Word Count of Sentences")

  ## Distribution: Histogram --------------------------------

  insighted %>%
    ggplot2::ggplot(ggplot2::aes(term_freq)) +
    ggplot2::geom_histogram() +
    ggplot2::labs(title = "Histogram of Word Frequency") +
    ggplot2::facet_wrap(groups)
  
  ggplot2::ggsave(filename = "word-freq-hist.png", device = "png", path="~/stats-781/out/")

  ## Score: barplot --------------------------------

  n <- 10

  insighted %>%
      dplyr::group_modify(~ {.x %>%
		      dplyr::distinct(bigram, .keep_all = TRUE) %>%
		      dplyr::arrange(desc(bigram_freq)) %>%
		      head(n)
    }) %>%
    dplyr::ungroup() %>%
      dplyr::mutate(bigram = tidytext::reorder_within(bigram,
                                                      bigram_freq,
                                                      !! ifexp(length(groups) > 1,
                                                               dplyr::syms(groups),
							       dplyr::sym(groups)))) %>% 
    ggplot2::ggplot(ggplot2::aes(bigram, bigram_freq)) +
    ggplot2::geom_bar(stat="identity") +
    ggplot2::facet_wrap(groups, scales = "free_y") +
    tidytext::scale_x_reordered() +
    ggplot2::coord_flip() +
      ggplot2::labs(title = "Bigrams by Bigram Frequency")
  
  ggsave(filename = "bigram-freq-bar.png", device = "png", path="~/stats-781/out/")
#+end_src

** ggpage
ggpage is a very interesting piece of visualisation, tested here. Once I build up the correct preparation format, I will perform more intensive testing here
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
filename <- "../data/raw/11-0.txt"

imported <- import_txt(filename) 

imported %>%
    ggpage_build() %>%
    filter(page == 1) %>%
    ggpage_plot()

imported %>%
    ggpage_build() %>%
    filter(page == 1) %>%
    get_insight(term_freq) %>%
    ggpage_plot(aes(fill=term_freq))

stopwords <- get_sw()

imported <- import_txt(filename) %>%
    format_data() %>%
    remove_stopwords(stopwords) %>%
    reconstruct()

imported %>%
    ggpage_build() %>%
    get_insight(term_freq) %>%
    ggpage_plot(aes(fill=term_freq))

imported %>%
    ggpage_build() %>%
    get_insight(keywords_tr) %>%
    ggpage_plot(aes(fill=rank))

imported %>%
    ggpage_build() %>%
    get_insight(word_sentiment_AFINN) %>%
    ggpage_plot(aes(fill=score)) +
    scale_fill_gradient2(low = "red", high = "blue", mid = "grey", midpoint = 0)
#+end_src
** shiny
#+begin_src R :session rsession1 :tangle ~/stats-781/test/tests.R :eval never-export :exports both
  library(shiny)
  library(inzightta)
  library(rlang)
  
  input <- list(file1 = list(datapath = "~/stats-781/data/raw/11-0.txt"),
                lemmatise = TRUE,
                stopwords = TRUE,
                sw_lexicon = "snowball",
                filter_var = NULL,
                filter_pred = NULL,
                section_by = "chapter",
                group_var = NULL,
                get_term_insight = TRUE,
                term_insight = "Lagged Term Sentiment",
                get_aggregate_insight = NULL,
                aggregate_insight = NULL,
                aggregate_var = NULL,
                vis = "struct_ts_ungrouped", ###  "struct_ggpage_ungrouped" "dist_density_ungrouped" "score_bar_ungrouped" "dist_hist_ungrouped" "struct_ts_ungrouped"
                vis_col = "Lagged Term Sentiment",
                vis_facet = "chapter",
                scale_fixed = TRUE)
  
                                        # Import & Process
  imported <- inzightta::import_files(input$file1$datapath)
  
  prepped <- {
      data <- imported
      if (isTruthy(input$lemmatise) |
          isTruthy(input$stopwords)){
          data <- data %>%
              text_prep(input$lemmatise, input$stopwords, input$sw_lexicon, NA)
      }
      data}
  
  filtered <- {
      data <- prepped
      if (isTruthy(input$filter_var) &
          isTruthy(input$filter_pred)){
          data <- data %>%
              dplyr::filter(!! dplyr::sym(input$filter_var) == input$filter_pred)
      }
      data
  }

  sectioned <- {
      data <- filtered
      if (isTruthy(input$section_by)){
          data <- data %>%
              section(input$section_by)
      }
      data
  }
  
  grouped <- {
      data <- sectioned
      if (isTruthy(input$group_var)){
          data <- data %>%
              dplyr::group_by(!! dplyr::sym(input$group_var))
      }
      data
  }
  
  term_insights <- {
      data <- grouped
      if (isTruthy(input$get_term_insight) &
          isTruthy(input$term_insight)){
          data <- data %>%
              get_term_insight(input$term_insight)
      }
      data
  }
  
  aggregate_insights <- {
      data <- term_insights
      if (isTruthy(input$get_aggregate_insight) &
          isTruthy(input$aggregate_insight) &
          isTruthy(input$aggregate_var)){
          data <- data %>%
              get_aggregate_insight(input$aggregate_insight, input$aggregate_var)
      }
      data
  }
  
  get_vis(aggregate_insights, input$vis, input$vis_col, input$vis_facet, input$scale_fixed)
  
#+end_src

* Shiny Frontend
For the user interface, the obvious choice is shiny.

We first tried using an if statement to determine the data, as per
 #+begin_src R :results output :colnames yes :hline yes :session rsession1 :tangle no :comments link :exports both :eval never-export
       data <- reactive({
          data <- inzightta::import_files(input$file1$datapath)
          if (isTruthy(input$lemmatise) | isTruthy(input$stopwords)){
              data <- data %>%
                  text_prep(input$lemmatise, input$stopwords, input$sw_lexicon, NA)
          }
          if (isTruthy(input$filter_var) & isTruthy(input$filter_pred)){
              data <- data %>%
                  dplyr::filter(!! dplyr::sym(input$filter_var) == input$filter_pred)
          }
          if (isTruthy(input$group_var)){
              data <- data %>%
                  dplyr::group_by(!! dplyr::sym(input$group_var))
          }
          data
      })
#+end_src
However, this led to variable selectors constantly changing, as they had to recompute the names of data() which ran through several states at every event.

We will use the following as our shiny app:
** Library Calls
#+begin_src R :session rsession1 :tangle ~/inzightta-shiny/app.R :eval never-export :exports both
  library(shiny)
  library(inzightta)
  library(rlang)
#+end_src
