doc/journal.tex
## })
\end{minted}

\subsubsection{Visualisation}
\label{sec:org8525b6d}
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
## Structure: ggpage --------------------------------
groups <- dplyr::group_vars(insighted)

insighted %>% #base data
  dplyr::group_modify(~ { #build ggpage
    .x %>%
      dplyr::pull(word) %>%
      ggpage::ggpage_build() %>%
      dplyr::bind_cols(.x)  
  }) %>%
  ggpage::ggpage_plot(ggplot2::aes(colour=mean_aggregate_sentiment_sentence)) + #plot ggpage
  ggplot2::scale_color_gradient2() +
  ggplot2::facet_wrap(groups) +
  ggplot2::labs(title = glue::glue("Mean Sentiment of Sentences by {paste(groups, collapse = \", \")}"))

ggplot2::ggsave(filename = "mean-sent-ggpage.png", device = "png", path="~/stats-781/out/")

insighted %>% #base data
  dplyr::group_modify(~ { #build ggpage
    .x %>%
      dplyr::pull(word) %>%
      ggpage::ggpage_build() %>%
      dplyr::bind_cols(.x)  
  }) %>%
  ggpage::ggpage_plot(ggplot2::aes(colour=sd_aggregate_sentiment_sentence)) + #plot ggpage
  ggplot2::scale_color_gradient2() +
  ggplot2::facet_wrap(groups) +
    ggplot2::labs(title = glue::glue("Sentiment Standard Deviation of Sentences by {paste(groups, collapse = \", \")}"))


ggsave(filename = "sd-sent-ggpage.png", device = "png", path="~/stats-781/out/")


insighted %>% #base data
   dplyr::group_modify(~ { #build ggpage
    .x %>%
      dplyr::pull(word) %>%
      ggpage::ggpage_build() %>%
      dplyr::bind_cols(.x)  
  }) %>%
  ggpage::ggpage_plot(ggplot2::aes(colour=term_count_sentence)) + #plot ggpage
  ## scale_color_gradient2() +
  ggplot2::facet_wrap(groups) +
  ggplot2::labs(title = glue::glue("Word Count of Sentences by {paste(groups, collapse = \", \")}"))

insighted %>%
  dplyr::pull(word) %>%
  ggpage::ggpage_build() %>%
  dplyr::bind_cols(insighted) %>%
  ggpage::ggpage_plot(ggplot2::aes(colour=term_count_sentence)) +
  ggplot2::labs(title = "Word Count of Sentences")

## Distribution: Histogram --------------------------------

insighted %>%
  ggplot2::ggplot(ggplot2::aes(term_freq)) +
  ggplot2::geom_histogram() +
  ggplot2::labs(title = "Histogram of Word Frequency") +
  ggplot2::facet_wrap(groups)

ggplot2::ggsave(filename = "word-freq-hist.png", device = "png", path="~/stats-781/out/")

## Score: barplot --------------------------------

n <- 10

insighted %>%
    dplyr::group_modify(~ {.x %>%
		    dplyr::distinct(bigram, .keep_all = TRUE) %>%
		    dplyr::arrange(desc(bigram_freq)) %>%
		    head(n)
  }) %>%
  dplyr::ungroup() %>%
    dplyr::mutate(bigram = tidytext::reorder_within(bigram,
						    bigram_freq,
						    !! ifexp(length(groups) > 1,
							     dplyr::syms(groups),
							     dplyr::sym(groups)))) %>% 
  ggplot2::ggplot(ggplot2::aes(bigram, bigram_freq)) +
  ggplot2::geom_bar(stat="identity") +
  ggplot2::facet_wrap(groups, scales = "free_y") +
  tidytext::scale_x_reordered() +
  ggplot2::coord_flip() +
    ggplot2::labs(title = "Bigrams by Bigram Frequency")

ggsave(filename = "bigram-freq-bar.png", device = "png", path="~/stats-781/out/")
\end{minted}

\subsection{ggpage}
\label{sec:orgfdf6903}
ggpage is a very interesting piece of visualisation, tested here. Once I build up the correct preparation format, I will perform more intensive testing here
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
filename <- "../data/raw/11-0.txt"

imported <- import_txt(filename) 

imported %>%
    ggpage_build() %>%
    filter(page == 1) %>%
    ggpage_plot()

imported %>%
    ggpage_build() %>%
    filter(page == 1) %>%
    get_insight(term_freq) %>%
    ggpage_plot(aes(fill=term_freq))

stopwords <- get_sw()

imported <- import_txt(filename) %>%
    format_data() %>%
    remove_stopwords(stopwords) %>%
    reconstruct()

imported %>%
    ggpage_build() %>%
    get_insight(term_freq) %>%
    ggpage_plot(aes(fill=term_freq))

imported %>%
    ggpage_build() %>%
    get_insight(keywords_tr) %>%
    ggpage_plot(aes(fill=rank))

imported %>%
    ggpage_build() %>%
    get_insight(word_sentiment_AFINN) %>%
    ggpage_plot(aes(fill=score)) +
    scale_fill_gradient2(low = "red", high = "blue", mid = "grey", midpoint = 0)
\end{minted}
\subsection{shiny}
\label{sec:org8f6a4c1}
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
library(shiny)
library(inzightta)
library(rlang)

input <- list(file1 = list(datapath = "~/stats-781/data/raw/conv.txt"),
	      lemmatise = TRUE,
	      stopwords = TRUE,
	      sw_lexicon = "snowball",
	      filter_var = NULL,
	      filter_pred = NULL,
	      group_var = NULL,
	      get_term_insight = TRUE,
	      term_insight = "Term Frequency",
	      get_aggregate_insight = NULL,
	      aggregate_insight = NULL,
	      aggregate_var = NULL,
	      vis = "struct_ggpage_ungrouped",
	      vis_col = "Term Frequency",
	      distribution = FALSE)

				      # Import & Process
imported <- inzightta::import_files(input$file1$datapath)
prepped <- {
    data <- imported
	if (isTruthy(input$lemmatise) |
	    isTruthy(input$stopwords)){
	    data <- data %>%
		text_prep(input$lemmatise, input$stopwords, input$sw_lexicon, NA)
	}
    data}
filtered <- {
    data <- prepped
	if (isTruthy(input$filter_var) &
	    isTruthy(input$filter_pred)){
	    data <- data %>%
		dplyr::filter(!! dplyr::sym(input$filter_var) == input$filter_pred)
	}
	data
}
grouped <- {
    data <- filtered
    if (isTruthy(input$group_var)){
	data <- data %>%
	    dplyr::group_by(!! dplyr::sym(input$group_var))
    }
    data
}
term_insights <- {
    data <- grouped
    if (isTruthy(input$get_term_insight) &
	isTruthy(input$term_insight)){
	data <- data %>%
	    get_term_insight(input$term_insight)
    }
    data
}
    aggregate_insights <- {
	data <- term_insights
	if (isTruthy(input$get_aggregate_insight) &
	    isTruthy(input$aggregate_insight) &
	    isTruthy(input$aggregate_var)){
	    data <- data %>%
		get_aggregate_insight(input$aggregate_insight, input$aggregate_var)
	}
	data
    }
get_vis(aggregate_insights, "struct_ggpage_ungrouped", input$vis_col, input$distribution)

\end{minted}
\section{Shiny Frontend}
\label{sec:org1a46e28}
For the user interface, the obvious choice is shiny.

We first tried using an if statement to determine the data, as per
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
 data <- reactive({
    data <- inzightta::import_files(input$file1$datapath)
    if (isTruthy(input$lemmatise) | isTruthy(input$stopwords)){
	data <- data %>%
	    text_prep(input$lemmatise, input$stopwords, input$sw_lexicon, NA)
    }
    if (isTruthy(input$filter_var) & isTruthy(input$filter_pred)){
	data <- data %>%
	    dplyr::filter(!! dplyr::sym(input$filter_var) == input$filter_pred)
    }
    if (isTruthy(input$group_var)){
	data <- data %>%
	    dplyr::group_by(!! dplyr::sym(input$group_var))
    }
    data
})
\end{minted}
However, this led to variable selectors constantly changing, as they had to recompute the names of data() which ran through several states at every event.

We will use the following as our shiny app:
