doc/journal.org
** UI
   #+begin_src R :session rsession1 :tangle ~/inzightta-shiny/app.R :eval never-export :exports both
     ui <- navbarPage("iNZight Text Analytics",
                      tabPanel("Processing",
                               sidebarLayout(
                                   sidebarPanel(
                                       tags$p("Import"),
                                       fileInput("file1", "Choose File(s)",
                                                 multiple = TRUE,
                                                 accept = c("text/csv",
                                                            "text/comma-separated-values,text/plain",
                                                            ".csv", ".xlsx", ".xls")),
                                       tags$hr(),
                                       tags$p("Process"),
                                       checkboxInput("lemmatise", "Lemmatise"),
                                       selectInput("sw_lexicon", "Stopword Lexicon", list("snowball")),
                                       checkboxInput("stopwords", "Stopwords"),
                                       uiOutput("vars_to_filter"),
                                       textInput("filter_pred", "value to match", ""),
                                       selectInput("section_by", "Section By",
                                                   list("", "chapter", "part", "section")),
                                       uiOutput("vars_to_group_on"),
                                       tags$hr(),
                                       tags$p("Term Insight"),
                                       selectInput("term_insight",
                                                   "Term Insight",
                                                   list("Term Frequency", "Bigrams", "Key Words", "Term Sentiment", "Lagged Term Sentiment"),
                                                   multiple=TRUE),
                                       actionButton("get_term_insight",
                                                    "Get Term Insight"),
                                       tags$p("Aggregate Insight"),
                                       uiOutput("var_to_aggregate_insight_on"),
                                       selectInput("aggregate_insight",
                                                   "Aggregate Insight",
                                                   list("Term Count", "Key Sections", "Aggregated Sentiment"),
                                                   multiple=TRUE),
                                       actionButton("get_aggregate_insight",
                                                    "Get Aggregate Insight")
                                   ),
                                   mainPanel(
                                       tableOutput("table")
                                   )
                               )),
                      tabPanel("Visualisation",
                               sidebarLayout(
                                   sidebarPanel(selectInput("vis",
                                                            "Visualisation Type",
                                                            list("struct_ggpage_ungrouped",
                                                                 "struct_ts_ungrouped",
                                                                 "score_bar_ungrouped",
                                                                 "dist_density_ungrouped",
                                                                 "dist_hist_ungrouped")),
                                                uiOutput("var_to_visualise"),
                                                uiOutput("vis_facet_by"),
                                                checkboxInput("scale_fixed", "Scale Fixed", value=TRUE)),
                                   mainPanel(
                                       plotOutput("plot")
                                   )
                               ))
                      )
#+end_src

** Server
#+begin_src R :session rsession1 :tangle ~/inzightta-shiny/app.R :eval never-export :exports both
  server <- function(input, output) {
      imported <- reactive({
          inzightta::import_files(input$file1$datapath)
      })
      prepped <- reactive({
          data <- imported()
          if (isTruthy(input$lemmatise) |
              isTruthy(input$stopwords)){
              data <- data %>%
                  text_prep(input$lemmatise, input$stopwords, input$sw_lexicon, NA)
          }
          data
      })
      filtered <- reactive({
          data <- prepped()
          if (isTruthy(input$filter_var) &
              isTruthy(input$filter_pred)){
              data <- data %>%
                  dplyr::filter(!! dplyr::sym(input$filter_var) == input$filter_pred)
          }
          data
      })
      sectioned <- reactive({
          data <- filtered()
          if (isTruthy(input$section_by)){
              data <- data %>%
                  section(input$section_by)
          }
          data
      })
      grouped <- reactive({
          data <- sectioned()
          if (isTruthy(input$group_var)){
              data <- data %>%
                  dplyr::group_by(!! dplyr::sym(input$group_var))
          }
          data
      })
      term_insights <- reactive({
          data <- grouped()
          if (isTruthy(input$get_term_insight) &
              isTruthy(input$term_insight)){
              data <- data %>%
                  get_term_insight(input$term_insight)
          }
          data
      })
      aggregate_insights <- reactive({
          data <- term_insights()
          if (isTruthy(input$get_aggregate_insight) &
              isTruthy(input$aggregate_insight) &
              isTruthy(input$aggregate_var)){
              data <- data %>%
                  get_aggregate_insight(input$aggregate_insight, input$aggregate_var)
          }
          data
      })
      output$table <- renderTable({
          aggregate_insights() %>% head(300)
      })
      output$plot <- renderPlot({
          req(input$vis)
          req(input$vis_col)  
          get_vis(aggregate_insights(), input$vis, input$vis_col, input$vis_facet, input$scale_fixed)
      })
      output$vars_to_filter <- renderUI(selectInput("filter_var",
                                                    "select which column to apply filtering to",
                                                    c("", names(prepped())) %||% c("")))
      output$vars_to_group_on <- renderUI(selectInput("group_var",
                                                      "select which columns to group on",
                                                      c("", names(sectioned())) %||% c("")))
      output$var_to_aggregate_insight_on <- renderUI(selectInput("aggregate_var",
                                                                 "select which column to aggregate insight on",
                                                                 c("", names(grouped())) %||% c("")))
      output$var_to_visualise <- renderUI(selectInput("vis_col",
                                                      "select which variable to visualise",
                                                      c("", names(aggregate_insights())) %||% c("")))
      output$vis_facet_by <- renderUI(selectInput("vis_facet",
                                                  "select which variable to facet on",
                                                  c("", names(aggregate_insights())) %||% c("")))
  }
#+end_src

** Program Call

#+begin_src R :session rsession1 :tangle ~/inzightta-shiny/app.R :eval never-export :exports both
  # Create Shiny app ----
  shinyApp(ui, server)
#+end_src
** Additional Functionality
todo:

- [ ] Allow additional stopwords
- [ ] Allow choice of stopword lexicon
- [ ] Allow additional arguments to insight functions in-app
- [ ] allow multiple groups
- [ ] fix document names
- [ ] allow non-lemmatised or stopworded text preparation
- [ ] add sectioning
- [ ] aggregate sentiment choice of statistic
- [ ] Have insights done automatically when creating visualisations
- [ ] Add page view
- [ ] rearrange ui
- [ ] separation in scale ggpage for sentiment etc
- [ ] automatic visualisation based on insight selection

Interface chapter
