doc/journal.tex
\subsection{Library Calls}
\label{sec:orgfb5c69c}
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
library(shiny)
library(inzightta)
library(rlang)
\end{minted}
\subsection{UI}
\label{sec:orge9c0dc3}
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
ui <- navbarPage("iNZight Text Analytics",
		 tabPanel("Processing",
			  sidebarLayout(
			      sidebarPanel(
				  tags$p("Import"),
				  fileInput("file1", "Choose File(s)",
					    multiple = TRUE,
					    accept = c("text/csv",
						       "text/comma-separated-values,text/plain",
						       ".csv", ".xlsx", ".xls")),
				  tags$hr(),
				  tags$p("Process"),
				  checkboxInput("lemmatise", "Lemmatise"),
				  selectInput("sw_lexicon", "Stopword Lexicon", list("snowball")),
				  checkboxInput("stopwords", "Stopwords"),
				  uiOutput("vars_to_filter"),
				  textInput("filter_pred", "value to match", ""),
				  uiOutput("vars_to_group_on"),
				  tags$hr(),
				  tags$p("Term Insight"),
				  selectInput("term_insight",
					      "Term Insight",
					      list("Term Frequency", "Bigrams", "Key Words", "Term Sentiment"),
					      multiple=TRUE),
				  actionButton("get_term_insight",
					       "Get Term Insight"),
				  tags$p("Aggregate Insight"),
				  uiOutput("var_to_aggregate_insight_on"),
				  selectInput("aggregate_insight",
					      "Aggregate Insight",
					      list("Term Count", "Key Sections", "Aggregated Sentiment"),
					      multiple=TRUE),
				  actionButton("get_aggregate_insight",
					       "Get Aggregate Insight")
			      ),
			      mainPanel(
				  tableOutput("table")
			      )
			  )),
		 tabPanel("Visualisation",
			  sidebarLayout(
			      sidebarPanel(selectInput("vis",
						       "Visualisation Type",
						       list("struct_ggpage_ungrouped")),
					   uiOutput("var_to_visualise"),
					   checkboxInput("distribution",
							 "Distribution")),
			      mainPanel(
				  plotOutput("plot")
			      )
			  ))
		 )
\end{minted}

\subsection{Server}
\label{sec:org99c1786}
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
server <- function(input, output) {
    imported <- reactive({
	inzightta::import_files(input$file1$datapath)
    })
    prepped <- reactive({
	data <- imported()
	if (isTruthy(input$lemmatise) |
	    isTruthy(input$stopwords)){
	    data <- data %>%
		text_prep(input$lemmatise, input$stopwords, input$sw_lexicon, NA)
	}
	data
    })
    filtered <- reactive({
	data <- prepped()
	if (isTruthy(input$filter_var) &
	    isTruthy(input$filter_pred)){
	    data <- data %>%
		dplyr::filter(!! dplyr::sym(input$filter_var) == input$filter_pred)
	}
	data
    })
    grouped <- reactive({
	data <- filtered()
	if (isTruthy(input$group_var)){
	    data <- data %>%
		dplyr::group_by(!! dplyr::sym(input$group_var))
	}
	data
    })
    term_insights <- reactive({
	data <- grouped()
	if (isTruthy(input$get_term_insight) &
	    isTruthy(input$term_insight)){
	    data <- data %>%
		get_term_insight(input$term_insight)
	}
	data
    })
    aggregate_insights <- reactive({
	data <- term_insights()
	if (isTruthy(input$get_aggregate_insight) &
	    isTruthy(input$aggregate_insight) &
	    isTruthy(input$aggregate_var)){
	    data <- data %>%
		get_aggregate_insight(input$aggregate_insight, input$aggregate_var)
	}
	data
    })
    output$table <- renderTable({
	aggregate_insights()
    })
    output$plot <- renderPlot({
	req(input$vis)
	req(input$vis_col)  
	get_vis(aggregate_insights(), input$vis, input$vis_col, input$distribution)
    })
    output$vars_to_filter <- renderUI(selectInput("filter_var",
						  "select which column to apply filtering to",
						  c("", names(prepped())) %||% c("")))
    output$vars_to_group_on <- renderUI(selectInput("group_var",
						    "select which columns to group on",
						    c("", names(filtered())) %||% c("")))
    output$var_to_aggregate_insight_on <- renderUI(selectInput("aggregate_var",
							       "select which column to aggregate insight on",
							       c("", names(grouped())) %||% c("")))
    output$var_to_visualise <- renderUI(selectInput("vis_col",
						    "select which variable to visualise",
						    c("", names(aggregate_insights())) %||% c("")))
}
\end{minted}

\subsection{Program Call}
\label{sec:orgea9aa89}

\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{r}
# Create Shiny app ----
shinyApp(ui, server)
\end{minted}
\subsection{Additional Functionality}
\label{sec:orgc87156c}
todo:

\begin{itemize}
\item[{$\square$}] Allow additional stopwords
\item[{$\square$}] Allow choice of stopword lexicon
\item[{$\square$}] allow multiple groups
\item[{$\square$}] fix document names
\item[{$\square$}] allow non-lemmatised or stopworded text preparation
\item[{$\square$}] add sectioning
\item[{$\square$}] aggregate sentiment choice of statistic
\item[{$\square$}] Have insights done automatically when creating visualisations
\item[{$\square$}] rearrange ui
\end{itemize}

Interface chapter
\end{document}